{
    "1": "Какая отрасль промышленности в Кыргызстане, привлекла внимание и создавала различные акционерные общества и компании для иностранного капитала в начале XX века?",
    "2": "Поводом к началу восстания 1916 года в Кыргызстане…",
    "3": "В 1816 г. руководителем восстания кеминских кыргызов был…",
    "4": "Характер воссстания 1916 года в Кыргызстане…",
    "5": "На II Всероссийском съезде Советов из Кыргызстана участвовал:",
    "6": "Крупный руководитель басмаческого движения на Юге Кыргызстана, командовавший объединенными силами мусульманской армии был…",
    "7": "«Кокандская автономия» как буржуазно национальное государство существовало с…",
    "8":"Первым председателем ЦИК Кыргызской Автономной республики был…",
    "9": "Организатором филиала национальной партии «Алаш» в Кыргызстане был…",
    "10": "14 октября 1924 г. была образована…",
    "11": "Земельно-водная реформа на юге Кыргызстана проводилась в…",
    "12":"Особенности коллективизации Кыргызстана.",
    "13":"Принудительное выселение бай-манапских и кулацких хозяйств за пределы республики, нанесшее большой урон сельскому хозяйству и общественной жизни Кыргызстана началось в…",
    "14":"Какую главную цель преследовали русско-кыргызские школы, открытые в начале XX века в Кыргызстане?",
    "15": "Какая власть установилась после Февральской революции в 1917 г. в Кыргызстане?",
    "16":"Была ли выполнена просьба тридцати подписавшихся ответственных лиц в Кыргызстане?",
    "17": "Правильно ли проводились политика «раскулачивания» в Кыргызстане",
    "18":"Можно ли сказать, что Кыргызская Советская Социалистическая Республика вела независимую политику?",
    "19":"В 1980 годах коренное изменение социально-экономическое развитие страны достигло ли успеха?",
    "20":"Какой слой населения в 1930-х гг., искал альтернативный путь развития в Кыргызстане?",
    "21":"Дайте анализ ситуации общества 30-х годов XX века в Кыргызстане",
    "22":"В каком уезде было уничтожено 70% населения в 1916 г?",
    "23":"Дополните предложение. В кровавые годы массовых сталинских репрессий в Кыргызстане было уничтожено ______, из них реабилитировано на сегодня ______",
    "24":"Дополните предложение. В марте 1922 года по инициативе ______ вновь был поднят вопрос об отделении кыргызских уездов от Туркестанской АССР и образовании на их базе ____",
    "25":"Дополните предложение. Согласно Конституции СССР 5 декабря 1936 года была провозглашена ____, в 23 Марта 1937 года _____ Кыргызская ССР.",
    "26":"Укажите видного политического лидера Кыргызстана, внесшего большой вклад в возвращение беженцев-кыргызов-участников восстания 1916 года.",
    "27":"Первый народный комиссар просвещения Кыргызстана",
    "28":"В какие годы Бишкек стал называться в честь полководца М. В. Фрунзе?",
    "29":"В «Декрете о земле» объявленной советской власти, земля…"
}