import 'package:flutter/material.dart';
import '../../config/style.dart';
import 'package:flutter_html/flutter_html.dart';
import '../../widgets/paragraph-header.dart';

class Paragraph10 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: Scrollbar(
            child: SingleChildScrollView(
      child: Column(children: <Widget>[
        ParagraphHeader("assets/images/article-pic10.jpg",
            "§10.Присоединение Кыргызстана к России. Национально-освободительная борьба в Кыргызстане"),
        Container(
          padding: EdgeInsets.all(10.0),
          child: Column(
            children: [
              Html(
                data: """
<center><b>Предпосылки присоединения к России:</b></center>
• Наличие посольской связи установленной в 1785 г., в 1788 г. по инициативе Атаке-бия. <br>
• Развитие капитализма в России. Поэтому для дальнейшего роста промышленности в стране требовались новые рынки сбыта товаров, источники  сырья. <br>
• Подчинение Туркестана Россией позволило бы России открыть прямой торговый путь через Казахстан и Кыргызстан в Афганистан, Индию и Китай. <br>
• Стимулирующим фактором были предпринимаемые соседними восточными странами и Британской империей попытки захватить Туркестан, включая и Кыргызстан. <br>
• Понимая важное политико-стратегическое значение Туркестана, Россия  прикладывала все усилия, чтобы опередить другие страны, особенно Британию, и самой утвердиться в регионе.

<p>В превращении Туркестана, включая и Кыргызстан в  объект русской колонизации важную роль играли причины, обусловленные отменой в России крепостного права.<br>
• Одной из них было резкое  возрастание  недовольства  крестьян, оставшихся после  реформы  1861 г.  без  земли.<br>
• Переселение  крестьян  из  центральных  губерний  России  должно  было  послужить созданию демографической опоры  царизма в Туркестане – широкого слоя  русских крестьян.</p>

<center><b>Основные мотивы сближения кыргызов с Россией: </b></center>
– В силу пережитков воинствующего средневековья происходит усиление  непрерывных междоусобных столкновений между кыргызскими племенами. О чем свидетельствует столкновение между племена Бугу и Сарыбагыш в 1854 г.  <br>
– Захват кыргызских земель кокандцами, введение жесткой формы эксплуатации населения. Несостоятельность кокандцев в обеспечении внутренней и внешней безопасности кыргызов. О чем свидетельствует позиция  кокандцев во время нашествия на кыргызов казахского хана Кенесары в  1846, 1847 гг.<br>
 – Существование реальной угрозы захвата земель и подчинения кыргызов  со стороны Циньской империи.  <br>
– Агрессия и жестокие походы казахского хана Аблая (1770-е годы) и его  внука Кенесары хана, (1846, 1847 гг.) на кыргызские земли. 

<center><b>Присоединение Северного Кыргызстана к России </b></center>
<p>• Толчком к новому оживлению кыргызско-русских взаимоотношений  послужило усиление агрессии Кокандского ханства по отношению к северным кыргызам. </p>
<p>• Начали проявлять заинтересованность в установлении более тесных контактов с кыргызами и российские власти. </p>
<p>• В 1813 г. от иссык-кульских кыргызов в Семипалатинск прибыло посольство во главе с Качибеком и Джакыпбеком. Их принял генерал-губернатор  Западной Сибири Г. Глазенап, послам были пожалованы чины капитанов  российской армии. </p>
<p>• В 1825 г. на берегу реки Джергалан состоялся курултай бийев рода Бугу и  на котором приняли решение о присоединении к России. </p>
<p>• Стремление родовой знати Бугу принятье к российское подданство ускорило антогонизм и междоусобицу между биями и манапами родов Сарыбагыш и Бугу. </p>
<p>• Неоднократные  обращения  о  принятии  подданства  России  бугинского  манапа Боромбая завершились принесением присяги делегации от имени  прииссыккульских кыргызов в Омске 17 января 1855г. </p>
<p>• В 1862 г. Чуйские кыргызы во главе с Жантаем Карыбек уулу и Байтиком  Канай уулу, а 1863 г. кыргызы Тенир-Тоо во главе с Турдумамбет бийем  по примеру иссыккульцев изъявили желание жить в мире и дружбе с Россией. В1864 г. принять подданство России изъявили желание кочевники  Кетмень-Тюбинской котловины. </p>
<p>• В августе 1860 г. Русские войска приступили к захвату крепости Токмак  и Пишпек. Вскоре возвратились в Верный. В 1862 г. царские войска начали военную компанию по присоединению Чуйской и Таласской долин,  Центрального Тянь-Шаня и в 1868 г. последним из северных кыргызов  приняли российское подданство манап Уметалы Ормон уулу со своими  подданными. </p>

<center><b>Восстание 1873–1876 гг. Завоевание Россией Южного Кыргызстана</b></center>
• Восстание жителей Ферганского региона в1873–1876 гг известно в истории под названиями «народное движение», «восстание Полот-хана», «Кокандское восстание». Возглавляли это восстание Исхак Асан уулу под  именем Полот-хан, Мамыр Мерген уулу, Момун Шамыркан уулу и др.

<center>Это восстание можно разделить на два временных этапа:</center>
• <b>Первый этап</b>,  охватывающий 1873–1874 гг., имел прогрессивные цели. Хотя восстание зачастую выражалось  в стихийных вспышках, это  было  антифеодальное  движение, направленное против  узурпаторской  власти  хана  Худояра, и шло снизу вверх. <br>
• Весной 1875 г. Начался <b>второй этап</b> движения, продолжавшийся и в 1876 г. Увеличение ханом Худояром размера податей  в три раза послужило новым толчком к  развитию этого народного движения. На  заключительном  этапе  восстание  было  направлено на борьбу против российских  колонизаторов. Жестокость царских войск  при подавлении восстания вызвала яростное сопротивление кыргызов и узбеков. 
<p>Силы были явно не равны. Преследуемые царскими войсками повстанцы  были подавлены. Было убито около 20 тыс. человек. 19 февраля 1876 г.  царь Александр III подписал указ о ликвидации Кокандского ханства. На  месте бывших владений ханства была образована Ферганская область. Ее  губернатором был назначен генерал М. Скобелев.</p>
• Кокандское ханство пало, но южно-кыргызские горные территории, Алай  и другие еще не были подчинены Россией. Генерал М. Скобелев задался  целью до корней истребить остатки восстания и неуклонно продолжать  захватническую политику царизма. <br>
• Борьбу свободолюбивых алайских кыргызов возглавляли сыновья Алымбек-датки и Курманджан-датки и верные сподвижники Пулат-хана. Отряду  Скобелева удалось вытеснить кыргызов занимавших позиции. Захватчики  никого не щадили. <br>
• В качестве посредника между алайцами и солдатами Скобелева Шабдан  баатыр попытался направить ход военной экспедиции как можно в более  мирное русло. <br>
• Курманджан-датка поняла бесперспективность борьбы, и не желая приносить в жертву невинных людей приняла мудрое решение сдаться царским  властям вместе со своими соплеменниками. Таким образом, весь Южный  Кыргызстан был завоеван силой царской армии.

<center><b>Историческое значение вхождения Кыргызстана в состав России </b></center>
• В составе России Кыргызстан вступил в мировой процесс модернизации в  политическом, экономическом, социально-культурном и др. аспектах.

<center>В политическом аспекте:</center>
• Была устранена угроза порабощения Кыргызстана соседними  слаборазвитыми государствами. <br>
• Предотвращена этническая ассимиляция кыргызов более крупными этносами.<br>
• Важным следствием явилось прекращение феодально-родовых междоусобиц  самих кыргызов, которые вели к политической раздробленности и разорению,  отрицательно сказываясь на хозяйственном и культурном развитии народа

<center>В экономическом аспекте:</center>
• Кыргызстан был включен в экономические процессы государств  восходящего капитализма.<br>
• Развитие капитализма в России оказало воздействие и на Кыргызстан, способствуя оживлению его экономики и  развитию производительных сил.<br>
• Капиталистические общественные отношения, развитие производительных сил  привели к разложению основ натурального и полунатурального хозяйства, росту  товарно-денежных отношений. Появились предприятия, зарождалась обрабатывающая, угольная и нефтедобывающая промышленности.

<center>В социально-культурном аспекте:</center>
• Началось комплексное научное изучение кыргызского общества, истории,  культуры, природы Кыргызстана. <br>
• Кыргызы получили возможность приобщиться к европейским передовым  достижениям культуры. <br>
• Получила развитие сеть светских и религиозных учебных заведений, культурно-просветительных заведений и больниц. <br>
• Начали издаваться учебники, первые научные труды, художественные произведения на кыргызском языке. <br>
• Появились новые города, как Бишкек, Токмак, Каракол и множество сельских населенных пунктов нового типа.

<center><b>Колониальная политика царизма</b></center>
<p>На вновь присоединенных территориях Россия планомерно насаждала свою  политическую  систему  управления.  Уже  в  60-е  гг.  XIX  столетия  кыргызские  роды  признавшие  протекторат  России,  были  включены  в  округ  Ала-Тоо  Семипалатинской  области,  подчиненной  Западно-Сибирскому  генерал-губернаторству.</p>
<p>В феврале 1865 г. была образована Туркестанская область, обширная территория, включающая в себя земли от Аральского моря до озера Иссык-Куль. В нее  вошла территория Северного Кыргызстана.</p>
<p>В 1867 г. Туркестанская область была преобразована в Туркестанское генералгубернаторство, разделенное на две области – Сыр-Дарьинскую (административный центр – Ташкент) и Семиреченскую (административный центр – Верный) В 1886 г. Туркестанское генерал-губернаторство было переименовано в Туркестанский край, в который вошли Самаркандская, Сыр-Дарьинская и Ферганская  области. Семиреченскую область в 1882 г. включили в Степное генерал-губернаторство, затем в 1899 г. она была вновь подключена к Туркестанскому краю.</p>

              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset(
                  "assets/images/paragraphs/administrative-judical-arrangement.jpg"),
              Html(
                data: """
<center><b>Земельная политика царского правительства </b></center>
• Колонизаторская политика царского правительства в Кыргызстане особенно ярко проявилась при решении земельного вопроса. Едва Кыргызстан  был присоединен к России, как началось непрерывное переселение российских крестьян на его территорию. <br> 
• При наделении землей переселенцев интересы кыргызов совершенно не  учитывались. Царские власти определяли переселившихся русских и украинцев на самые удобные для земледелия угодья, отнимая их у местного  населения. Переселенцы располагались в основном в Чуйской долине и  вокруг озера Иссык-Куль. <br>
• Каждому  крестьянину-переселенцу  выделялось  по  30  десятин  земли  (1дес. – 1,2 га), он освобождался от налогов сроком на 15 лет и от воинской  повинности. Кроме того, переселенцам предоставлялась безвозвратная денежная ссуда. <br>
• Чтобы узаконить аннексию земель у местного населения, царское правительство в 1891 г. утвердило специальное, так называемое «Степное уложение», согласно которому все земли, на которых жили и кочевали кыргызы, надлежало считать государственными.

              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/territory-policy.jpg"),
              Html(
                data: """
<center><b>Налоговая политика царизма </b></center>
• Туркестан, в том числе и Кыргызстан, был источником финансового дохода. Трудовые массы были обложены:  <br>
* кибиточной  податью; <br>
* государственным земельным налогом (10% от годового дохода); <br>
* налогом за освобождение от воинской повинности; <br>
* существовал государственный промысловый налог; <br>
* акцизный сбор и таможенная пошлина; <br>
* взимались гербовый сбор и пошлина за безвозмездный переход имущества от одного лица к другому. <br>
• Кроме основных налогов царское правительство и его представители на  местах взимали с трудового населения всевозможные подати и поборы.  Все эти и многие другие «общественные сборы» ничуть не уступали налогам в Кокандском ханстве.


              
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/tax-policy.jpg"),
              Html(
                data: """
<center><b>Национально-освободительная борьба в Кыргызстане. </b></center>
<p><b>Андижанское восстание</b> вошло в историю как крупное народное движение конца XIX века в Средней Азии. Основными причинами восстания  послужили:<br>
 – колониальная политика царизма;   <br>
– усиление социального и национального гнета; <br>  
– произвол в отношении местного населения. </p> 

<p>•  Восстание вспыхнуло 17 мая 1898 г. в кишлаке Таджик (Мин-Дюбе). Возглавил восстание ишан этого селения Мадали Дукчи (ийикчи-веретенщик). Идейным руководителем этого восстания был Зиядин Максым уулу.  </p>
<p>•  Восставшие двинулись к Андижану. Число восставших достигло 2000 человек.  Около 3 часов ночи повстанцы вошли в Андижан и напали на лагерь 20го Туркестанского линейного батальона, где располагались 2 роты. </p>
<p>•  Силы были неравны. Вооруженная палками и серпами толпа была рассеяна  вооруженными царскими войсками. Было убито свыше 20 царских солдат и  офицеров. Повстанцы понесли большие потери. Мадали был взят в плен и 12  июня 1898 г. повешен. </p>
<p>•  Однако восстание не утихло и распространилось в Ферганскую долину. Активное участие в нем приняло население Андижанского, Маргеланского, Ошского и Наманганского уездов. </p>
<p>•  Для подавления восстания использовались многочисленные специальные отряды всего Туркестанского округа. </p>
<p>•  Было арестовано 777 человек, 415 были привлечены к судебной ответственности. Повешено 22 человека, 199 приговоренным заменили смертную казнь  длительными сроками каторги, из них 130 были кыргызы, 52 узбеки, 13 уйгуры,4 турка. Среди них оказался схваченный по навету недругов известный  акын-демократ Токтогул Сатылганов </p>
<p>•  Несмотря на поражение, это восстание было первым проявлением народной  борьбы против колониально-шовинистической политики, насаждаемой царизмом в Туркестане. Это была борьба народа за независимость. Поражение не  смогло затушить начавшиеся в массах свободолюбивые брожения. </p>

<center><b>Восстание 1916 года</b></center>
<center>Причины восстания:</center>
•  усиление русификации Кыргызстана как основы колониально-шовинистической политики; <br>
•  массовое переселение крестьян из России и усиление произвола при их расселении. В 1916 г. русским, составлявшим 6% населения Кыргызстана , было  выделено 57,7% пригодных для возделывания земель; <br>
•  содержание царской и местной администрации целиком возлагались на плечи  коренных жителей; <br>
•  русские колонизаторы не были заинтересованы в развитии края, его экономики, культуры, образования, подготовки кадров, улучшения условий жизни.

<center><b>Повод и ход восстания </b></center>
<p>• Доведенный до отчаяния колониальными притеснениями народ был готов  подняться с оружием в руках на открытую освободительную борьбу. </p>
<p>• Непосредственным поводом к вспышке народного гнева послужил указ  царя от 25 июня 1916 г. о привлечении туркестанских народов к военнооборонительным работам – мужчин с 19 до 43 лет. </p>
<p>• Восстание, начавшееся 4 июля 1916 г. в г. Ходжент Самаркандской области, быстро распространилось на Сыр-Дарьинскую и Ферганскую области. </p>
<p>• В течение июля южная часть Кыргызстана оказалась охвачена пламенем  народного восстания. </p>
<p>• В августе 1916 г. вся Семиреченская область была вовлечена в орбиту  восстания. Восстание на севере Кыргызстана характеризовалось особой  остротой и динамичностью, здесь это проходило на уровне вооруженных  столкновений. </p>
<p>• Большинство родовитых людей, испытавших на себе притеснения колониальной политики, в трудное для народа время были на его стороне (например, манапы Канат Убыке уулу, Мокуш Шабдан уулу и др.). </p>
<p>• Восставшие требовали отмены указа царя, уничтожали списки призывников, разрушили почту, телеграфные линии, разгромили переселенческие  поселки, массовые беспорядки сопровождались резней (избиения и убийства). </p> 
<p>• Восставшие отказывались выполнять приказ о наборе рабочих на военнотыловые работы, предпочли умереть, защищая свои семьи и Родину. </p>

<center><b>Подавление восстания </b></center>
<p>•  Царское правительство, опасаясь распространения восстания по всему  Туркестану, отозвало из действующей армии генерала А. Куропаткина и  назначило его генерал-губернатором Туркестанского края. </p>
<p>• 17 июля 1916 г. в Туркестане было введено военное положение, приказом  военного министра в округ было направлено 2 армейских батальона и 3300  казаков (казачье войско). Они имели 42 пушки и 69 пулеметов. </p> 
<p>• Подавление восстания в Джеты-Суу в общей сложности участвовало 6530  солдат туркестанского военного округа, из них 1105 кавалеристов. </p>
<p>• Позже, по приказу военного министра, с фронтов первой мировой войны  дополнительно прибыло 2 казачьих полка, 240 конных разведчиков, вооруженных 16 орудиями и 47 пулеметами. </p>
<p>• Кроме того, еще до восстания 43% крестьян-переселенцев были вооружены. 15 августа 1916 г. военный губернатор Джеты-Суу М. Фильбум дал 
указания организовать для подавления восставших конные и пешие дружины  из числа русских крестьян. </p>
<p>•  Чтобы повысить оперативность карательных мер против восставших, генералгубернатор Туркестана А. Куропаткин 12 августа 1916 г. отдал приказ о создании временных военно-полевых судов. </p>
<p>•  Для царских войск не составляло большого труда подавить стихийно восставший народ, вооруженный вилами, косами, дубинами, дедовскими саблями, пистонными ружьями или кое-где винтовками. </p>
<p>•  Армейские казачьи отряды, отлично обученные военной тактике, с особой  жестокостью и циничностью громили возникшие на территории Кыргызстана  очаги восстания. </p>
<p>•  Спасаясь от поголовного уничтожения, кыргызы в конце сентября начали беспорядочный исход в Китай. </p>
<p>•  Исход пришелся на зимнее время, многие бежавшие погибли от рук карательных отрядов, замерзли на заснеженных, покрытых льдом перевалах, сорвались  в пропасть, умерли от голода. </p>
<p>•  Чудом оставшиеся в живых нашли свое убежище в Китае, где их ждали страдания и лишения, не считая голод. По китайским сведениям из области ДжетыСуу бежало 332 тыс. человек, из них 130 тыс. кыргызы. В восстании погибло  около 200 тыс. кыргызов. Населения северного Кыргызстана сократилось на  41,1% </p>

<p><center>«План А. Куропаткина»</center> А. Куропаткин,  будучи  генерал-губернатором  Туркестанского  края,  16  октября  1916 г. на совете края принял план, согласно которому кыргызов Чуйской долины  и Иссык-Кульской котловины, как участников восстания, необходимо выслать в Нарын (свыше 50 тыс. хозяйств), 4 млн. 800 тыс. десятин кыргызских земель передать  русским переселенцам и казакам. Образовать Нарынский уезд, определить место  расположения административного центра уезда и двух приставов, всем русским  переселенцам нарынского края предоставить земли в Прежевальском уезде, вдоль  границ России и Китая организовать военные гарнизоны  в случае беспорядков безоговорочно применять крайние меры. </p>
<p>Этот совершенно «дикий» план резервации по американскому образцу не удалось  осуществить, благодаря Февральской революции, а затем установлению Cоветской власти в Кыргызстане.</p>
<p>•  Несмотря на поражение и жестокое подавление, восстание 1916 г. в значительной мере пошатнуло и ослабило колониальный режим в Туркестанском  регионе. </p>
<p>•  Народные массы получили небывалый опыт борьбы за свободу. </p>
<p>•  Это борьба кыргызского народа за родную землю, справедливость и независимость стала одной из самых трагических страниц истории Кыргызстана. </p>

              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              )
            ],
          ),
        ),
      ]),
    )));
  }
}
