import 'package:flutter/material.dart';
import '../../style.dart';
import 'package:flutter_html/flutter_html.dart';
import 'paragraph-header.dart';

class Paragraph15 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: Scrollbar(
            child: SingleChildScrollView(
      child: Column(children: <Widget>[
        ParagraphHeader("assets/images/article-pic15.jpg",
            "§15.Кыргызстан в период \"Развитого социализма\" и \"Перестройки\" (1964-1990 гг.)"),
        Container(
          padding: EdgeInsets.all(10.0),
          child: Column(
            children: [
              Html(
                data: """
<center><b>1. Кыргызстан в период «развитого социализма» (1964–1985 гг.)</b></center>
<center><b>Общественно – политическая жизнь </b></center>
<p>• В 1964 г. Первым секретарём ЦК КПСС стал Л. И. Брежнев, председателем Совета Министров СССР – А. Н. Косыгин. Таким образом, в административно-командную систему СССР пришло новое руководство.</p>
<p>В этот период в стране утверждалось верховенство партии, взявшей на себя  функции непосредственного вмешательства во все сферы общественной жизни. Партийные руководители на местах превратились в единовластных наместников, послушно исполнявших указания из центра.</p>
<p>• В  Киргизской  ССР  партийно-правительственные  бразды правления с 1961 г. перешли к Турдакуну  Усубалиеву. </p>
<p>• Для закрепления роли КПСС в общественно-политической системе СССР и обоснования сущности  «развитого социализма» 7 октября 1977 г. была принята и новая редакция Конституции СССР. На её основе 20 апреля 1978 г. принята и новая Конституция  Киргизской ССР.</p>
<p>В этих основных законах, в специальной статье, утверждалось, что Компартия  является «руководящей и направляющей силой Советского общества, ядром  государственных и общественных организаций». Этим самым в стране узаконивалась власть КПСС.</p>              
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Usubaliev.jpg"),
              Text(
                "Т. Усубалиев",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<center><b>Развитие промышленности в условиях «развитого социализма» </b></center>
<p>• В 1965 г. в стране началась новая реформа народного хозяйства. Организованные в 1957 г. по настоянию Н. Хрущёва Советы народного хозяйства  (совнархозы) были упразднены, восстановлены отраслевые министерства.  </p>
<p>В соответствии с установками реформы:  <br>
– был поставлен заслон необоснованным вмешательствам в производственную  деятельность предприятий;  <br>
– уменьшился поток указаний «сверху»;  <br>
– Принимались меры по повышению материальной заинтересованности и т. д.</p>
<p>•  В первые годы реформа дала хорошие результаты. Промышленность СССР,  включая и Кыргызстан, ускорила темпы развития. За годы восьмого пятилетнего плана (1966–1970 гг.) экономика страны испытывала небывалый подъем. </p>
<p>•  Промышленность Кыргызстана в обстановке «развитого социализма развивалась как органическая часть единого народно-хозяйственного комплекса  СССР. В 1965–1985 гг. национальный доход республики вырос в 2,7 раза,  объём промышленной продукции – в 4,4 раза. Из них объёмы продукции машиностроения и обработки металлов выросли в 8 раз, а производство электроэнергии – в 5 раз. В эти годы 60% валовой продукции, более половины  национального дохода республики приходилось на промышленное производство. Было построено 150 новых промышленных предприятий.</p>
<p>В начале 80-х гг. 40% добываемого в Средней Азии каменного угля приходилось на. долю Кыргызской ССР. Однако эти показатели были достигнуты за  счёт экстенсивного развития промышленности. Рост энергетики Кыргызстана  был обеспечен за счёт строительства на Нарынском каскаде Уч-Курганской и  Токтогульской ГЭС. К середине 80-х гг. на гидроэлектростанциях республики в год вырабатывалось 11 млрд. киловатт-часов электроэнергии. Одна из  самых перспективных отраслей современной индустрии Кыргызстана – <b>гидроэнергетика</b> – сформировалась именно в эти годы.</p>
<p>•  В общесоюзном распределении сфер деятельности важную роль имело производство в Кыргызстане сурьмы, ртути, редких металлов. Выработанная на  Кадамджайском комбинате сурьма была признана на международном рынке  эталоном качества. Высоко ценилась на мировом рынке и продукция Хайдарканского ртутного комбината. В 70–80-х гг. цветная металлургия вышла в  промышленности республики на первое место. За 1970–1985 гг. производство  цветных металлов увеличилось более чем в два раза. Эта продукция экспортировалась в 40 стран мира. Помимо этого, были открыты новые залежи золота,  меди, олова и др. металлов, на местах началось строительство добывающих  предприятий.</p>
<p>В области машиностроительной промышленности Кыргызстан вышел на  первое место среди республик Средней Азии. В одиннадцатой пятилетке  (1981–1985 гг.) более 50% валовой продукции республики производили машиностроительная и металлообрабатывающая отрасли.</p>
<p>•  С развитием промышленности в республике вырос и окреп рабочий класс.  Если в 1960 г. во всех отраслях народного хозяйства Кыргызстана трудилось  310 тыс. рабочих, то к 1985 г. их число превысило 866 тыс., что составило  рост в 2,8 раза. В итоге в социально-классовой структуре республики начиная 
с 70-х годов рабочие (вместе с семьями) составляли около 58% всего населения. Из них занятые в промышленности составляли 31%, остальные работали  в сельском хозяйстве, строительстве, на транспорте, в сфере связи обслуживания и т. д. Количество рабочих росло и за счёт местного населения. В 1970 г.  в народном хозяйстве трудилось 172 тыс. рабочих-кыргызов. По сравнению с  1959 г. это было в 2,4 раза больше. Если в 1963–1985 гг. число занятых в промышленности рабочих и служащих увеличилось в 2 раза, то число кыргызов  среди них выросло в 4 раза.</p>
<p>В индустриальных отраслях промышленности в основном, были заняты рабочие, прибывшие из центральных регионов СССР. Вместо подготовки рабочих  кадров из представителей коренной национальности в эти годы практиковалась  устоявшаяся тенденция привлекать в республику специалистов со стороны,  путём предоставления им элитных условий для работы и проживания. Всё это  препятствовало необходимому развитию рабочего класса из среды местного населения.</p>
<center><b>Сельскохозяйственное производство</b></center>
<p>• В соответствии с требованием времени мартовский (1965 г.) Пленум ЦК  КПСС  принял  Постановление  «О  неотложных  мерах по  дальнейшему  подъему сельского хозяйства СССР». </p>
<p>• Для претворения в жизнь комплексной программы подъема сельского хозяйства из национального дохода были выделены увеличенные по сравнению с предыдущими годами средства.</p>

<center>Для сельского хозяйства Кыргызской ССР</center>
• В 1966–1975 гг. из государственных и колхозных средств было  выделено 2 млрд. 586 млн. рублей капитальных вложений.<br>
• В 1976–1985 гг. выделено 4 млрд.  33 млн. рублей или 4 раза больше  чем за все предыдущие годы Советской власти.
<p>• Эти средства были в первую очередь использованы для укрепления материально-технической базы сельскохозяйственного производства. </p>
<p>• К концу 1985 г. в Кыргызстане имелось 178 колхозов (в них 172 тыс. дворов) и 290 совхозов (в них 215 тыс. работников), 89 межхозяйственных  предприятий по обслуживанию производства на селе. <p>
<p>В 1985 г. в Кыргызстане на каждое хозяйство приходилось по 72 трактора, 36  грузовых автомобилей, 20 комбайнов, энергетическая мощность сельского хозяйства по сравнению с 1965 г. выросла в 5 раз. Никогда еще сельское хозяйство  не получало такого мощного технического вооружения.</p>
<p>• Наряду с высокой механизацией сельского хозяйства у жителей села появились условия для более широкого и эффективного использования в  производстве сельхозпродукции и электроэнергетических мощностей. Это  стало возможным благодаря тому, что в Кыргызстане был построен и введен в эксплуатацию ряд новых гидроэлектростанций, которые существенно повысили выработку электроэнергии в республике. В 1965–1985 гг.  мощность гидроэлектростанций Кыргызстана выросла с 249,3 тыс. киловатт-часов до 2 млн. 416 тыс., т. е. в 9 раз; а энергоемкость – с 999,3 млн.  кВт. часов до 6063,5 млн., или более, чем в 6 раз. Все районы, колхозы  и совхозы республики были подсоединены к централизованной государственной энергетической системе.</p>
<p>Принимая во внимание огромную важность мелиорации земель в условиях  Кыргызстана, на эти цели республике было выделено из государственных и  колхозных средств соответственно 1,3 млрд. и 130 млн. рублей. Это было в  5 раз больше, чем за сорок предыдущих лет. В итоге целевого использования  выделенных средств были построены и введены в эксплуатацию новые оросительные системы, крупные гидротехнические сооружения, приспособленные  для хранения и рационального использования водных ресурсов. В систему орошения добавочно вошло 224 тыс. га пахотных земель и 1789 тыс. га пастбищ.  Площадь поливных земель превысила 1 млн. гектаров. <em>В Кыргызстане – впервые по стране, в орошении земель была использована автоматизированная система водораспределения.</em></p>

<center><b>Однако! </b></center>
<p>• Капитальные вложения в сельскохозяйственное производство, меры по  развитию производственных отношений положительным образом сказались на увеличении валовой продукции сельского хозяйства республики.  Но экстенсивный характер развития сельского хозяйства в условиях плановой экономики, постоянные ограничения новых методов организации  производства со стороны административно-командных структур и самое  главное – недостаточная заинтересованность трудящихся в развитии этой  сферы привели в конечном итоге, особенно в последнее десятилетие, к  прогрессирующему спаду сельскохозяйственного производства в целом.  Себестоимость основных видов продукции сельского хозяйства приобрела 
стойкую тенденцию удорожания. В период с 1965–1985 гг. в хозяйствах республики себестоимость центнера пшеницы, хлопка, картофеля, табака выросла в  два раза, овощей и фруктов – в 5 раз. Это явление было присуще и животноводству. В условиях командной экономики, и особенно в годы одиннадцатой пятилетки, сельскохозяйственное производство впало в глубокий кризис. В 1985 г.  60,6% колхозов и совхозов были нерентабельны. Долги хозяйств государству  росли из года в год. </p>
<p>•  Утверждение в земледелии хлопка, сахарной свеклы, картофеля и других видов монокультуры привело к ухудшению физических свойств почвы и снижению урожаев. В животноводстве разведение овец в большом  количестве  нанесло непоправимый ущерб почве и окружающей среде.  </p>

<center><b>2. Кыргызстан в эпоху «перестройки» (1985–1991 гг.) </b></center>
<center><b>Общественно – политическая обстановка </b></center>
<p>•  К середине 80-х гг. стало очевидным, что СССР окончательно увяз в экономическом, социальном и политическом кризисе, а принципы командо-административного  управления  перестали  соответствовать  новым  требованиям  времени. Внутренний кризис в стране сопровождался и усугублялся внешнеполитическим кризисом. В мировой политике, в общей системе социализма  авторитет и значение СССР резко пошли на спад.</p>
<p>Часть высших партийно-государственных руководителей понимала, что установленная в стране система полностью исчерпала свои возможности и что косметические поправки не дадут результатов. В этой обстановке Генеральным  секретарём ЦК КПСС 11 марта 1985 г. был избран М. С. Горбачёв. Хорошо понимая, что жить и работать по-старому невозможно, М. Горбачёв на апрельском  (1985 г.) Пленуме партии предложил реформаторские пути решения, основных  вопросов общественно-экономической жизни страны. Пленум провозгласил новую стратегию социально-экономического развития СССР.</p>
<p>•  Обновление партийного руководства прошло по всей  стране. В 1985 г. Турдакун Усубалиев, около четверти  века возглавлявший Центральный Комитет Компартии  Кыргызстана, был снят с поста, и на его место избран  <b>Абсамат Масалиев.</b></p> 
<p>•  На XXVIII съезде КПСС был принят программный документ – «Основные направления экономического и  социального развития СССР на 1986–1990 гг. и в период до 2000 г.». В материалах съезда по инициативе  М. Горбачёва  были  определены  основные  задачи  <b>«стратегии ускорения»</b> развития страны.</p>
<p>•  В 1987 г. на январском Пленуме ЦК КПСС М. Горбачёв провозгласил  новую «политику гласности». Средства массовой информации сначала  выборочно, а затем полностью начали освещать вопиющие недостатки во  всех сферах общественной жизни. Вместе с тем было широко распространенно мнение, что все просчёты и недостатки социалистического строительства связаны с отходом от ленинских норм, и в качестве панацеи всему выдвигалась необходимость возврата к «ленинским принципам».</p>              
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Masaliev.jpg"),
              Text(
                "А. Масалиев",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<p>В 1988–1989 гг. в СССР, включая и Кыргызстан, возникла новая ситуация. Если  до этого перестройка осуществлялась сверху, по инициативе органов власти, то  теперь её проводниками стали «низы» – активно действующие народные массы  и общественные организации. Ускоренными темпами проходил процесс политизации общества. В Кыргызстане возникали первые дискуссионные и политические молодёжные клубы, члены которых горячо обсуждали актуальные вопросы  общественной жизни и открыто выражали своё мнение.</p>
<p>• В условиях роста политической активности населения Кыргызстана и возрождения  национального  самосознания  Верховный  Совет  Кыргызской  ССР, еще находившийся под полным контролем Компартии Кыргызстана,  принял 23 сентября 1989 г. закон «О государственном языке Киргизской  ССР», в котором кыргызский язык объявлялся государственным языком,  русский язык был определён как язык межнационального общения, а также были даны гарантии обеспечения свободного развития языков других  национальностей, проживающих в республике.</p>
<p>Принятые 12 декабря 1989 г. на внеочередной XXII сессии Верховного Совета  СССР законы «Об изменениях и дополнениях Конституции (Основного закона)  СССР» и «О выборах Народных депутатов» создали условия для кардинальной  перестройки государственной системы страны. На основании этих документов  впервые в СССР согласно волеизъявлению народа органом высшей власти был  утверждён Съезд Народных депутатов СССР. Эти законы были призваны осуществить глубокую демократизацию политической системы республики, конкретно реализовать права граждан в управлении государством, реформировать  характер деятельности Советов и повысить их роль.</p>
<p>• В феврале 1990 г. были проведены выборы в Верховный и местные Сове  ты Кыргызской ССР. Это были первые альтернативные выборы в истории  Кыргызской Республики. Во многих избирательных округах на одно депутатское место регистрировалось более двух кандидатов и выборы проходили в два тура.</p>
<p>•  В апреле 1990 года первой сессии Верховного Совета Кыргызской ССР Первый секретарь Центрального Комитета Компартии Кыргызстана Абсамат Масалиев был избран Председателем Верховного Совета Кыргызской ССР, став  таким образом, главой государства. На сессии были выдвинуты предложения  по определению конкретного круга прав государственных ветвей власти, а  также по введению в республике президентского правления.</p>
<center><b>Экономика в годы «перестройки» </b></center>
<p>•  Перестройка экономики страны ознаменовалась переходом к экономическим  методам управления. В результате этого расширилась самостоятельность  промышленных и сельскохозяйственных предприятий, начал осуществляться переход к полному хозрасчёту на основе самоуправления, самофинансирования и самоокупаемости. В 1986 г. на эту форму хозяйствования перешли  125 предприятий и объединений, производящих 70% промышленной продукции республики. В них было занято более половины рабочих всей промышленности Кыргызстана. Начиная с 1987 г., «перестройка» охватила и другие  отрасли народного хозяйства республики - строительство, транспорт, связь,  торговлю и т. д.</p>
<p>Июльский 1987 года Пленум ЦК КПСС принял директивное постановление  о радикальном реформировании экономики страны. Основной задачей «перестроечной»  реформы  был  переход  от  командно-административной  системы  управления к методам экономического стимулирования, хозрасчёта и личной  заинтересованности трудящихся.</p>
<p>•  Чтобы обновить экономический спад и стабилизировать финансовые отношения в стране, на сессии Верховного Совета СССР в 1987 г. было принято стратегическое решение о переходе к рыночной экономике. </p>
<p>•  В западных странах рыночная экономика формировалась естественным путём, на протяжении веков, и прошла много различных ступеней, прежде чем  достигла современного расцвета. Этот путь шёл от свободной экономики,  ограничивающей функции государства, к экономике, повышающей регулирующую роль государственных институтов, т. е. к смешанным экономическим  структурам.</p>
<p>Для законодательного утверждения перехода народного хозяйства Кыргызстана на рыночную экономику 7 августа 1991 г. был принят закон «Об общих началах разгосударствления, приватизации и предпринимательства в Кыргызской  Республике». В этом документе в целях активизации и усиления предпринимательской деятельности, в республике были определены пути преобразования  государственных и коммунальных предприятий в арендные, государственные и  акционерные коммерческие общества.</p>
<p>•  В ходе реализации экономической реформы почти все промышленные предприятия республики были переведены на самоуправление и самофинансирование. Возросла гласность в управлении, сократились закрытые собрания и  совещания ответственных работников. Всё это дало заметный прирост производительности труда. В 1986–1990 гг. производство промышленной продукции республики увеличилось на 17,5%. </p>

<center><b>Однако! </b></center>
<p>•  Однако в 1990 г. темпы развития промышленности резко снизились. Из-за  бесконтрольного и нецелевого расходования средств строительство более 50  предприятий, общей стоимостью в 1,3 млрд. рублей, осталось незавершённым. Промышленность Кыргызстана стала впадать в глубокую депрессию.  Основной причиной было то, что в результате проводимой в СССР политики  единого народно-хозяйственного комплекса, предприятия страны были кооперированы, для производства готовой продукции. Разные республики должны были поставлять друг другу сырьё, полуфабрикаты и запасные части. Но  с началом распада Союза договорные обязательства, дисциплина взаимопоставок и межрегиональные связи разрушились. Недолго просуществовал и  бартерный обмен. С этого времени кризис промышленного производства обрёл ускоренный процесс, построенные с большим трудом и затратами предприятия подверглись разрухе и расхищению. </p>
<p>•  В конце 1989 г. началось снижение объемов промышленного производства,  которое продолжалось весь 1990 г. Показатели прироста промышленного производства не переставали снижаться. </p>
<p>•  Уровень жизни катастрофически падал. </p>
<p>•  Все попытки власти обуздать инфляцию не давали желаемого результата. </p>
<p>•  Реформаторы  предоставляя  государственным  предприятиям  самостоятельность и расширяя их права на основе принципов самоокупаемости, самофинансирования, в том числе  ценообразования предполагали, что эти меры выведут страну из кризиса и укажут путь к рыночным отношениям, однако этого  не случилось. </p>

<center><b>Особенности перевода сельского хозяйства на рыночные отношения </b></center>
<p>•  Для скоординированной реформы этой важной отрасли народного хозяйства  необходимо было создать прочную законодательную основу. С этой целью в  1986–1990 гг. были изданы соответствующие законы о земле, аренде, земельной собственности, землепользовании и др. </p>
<p>•  Наряду с прежними колхозами и совхозами были разрешены и другие различные формы и методы ведения хозяйства. На новых экономических принципах  узаконены крестьянские хозяйства, кооперативы, бригадный подряд, аренда. 
Все эти виды хозяйствования строились на принципах хозрасчёта и самофинансирования. В производстве продукции и её реализации установились отношения свободной конкуренции. </p>

<p>Для повышения оперативности управления сельским хозяйством республики  семь  министерств,  такие,  как  сельского  хозяйства,  мясо-молочной,  пищевой  промышленности,  сельского  строительства  и  др.,  были  преобразованы  в  <b>Государственный агропромышленный комитет Кыргызской ССР.</b>  В  1987 г.  в  ведомство  комитета  входило  178  колхозов,  291  совхоз,  43  межхозяйственных  и  других  сельскохозяйственных  предприятий.  Кроме  того,  ему  были  переданы  6  предприятий  по  переработке  сельхозпродукции,  104  предприятия пищевой промышленности, 142 организации сельскохозяйственного строительства. В результате планирование, финансирование и управление сельским хозяйством стало более упорядоченным и централизованным.  Прежний управленческий аппарат был сокращён наполовину. </p>
<p>•  В итоге реформирования сельского хозяйства экономическое положение колхозов и совхозов несколько улучшилось. За 1986–1989 гг. их доход вырос на  47%, повысилась рентабельность. Самое главное – население снабжалось продуктами питания в достаточном количестве. </p>
<p>•  В 1990 г. в республике насчитывалось 1205,2 тыс. голов крупного рогатого скота, 10 млн. коз и овец, 393,4 тыс. свиней, 312,6 тыс. лошадей, 14 млн. кур.</p>

<center><b>Однако! </b>
<p>•  С увеличением поголовья скота продуктивность пастбищ снизилась в 1,5–2  раза, а в отдельных регионах пастбища пришли в негодность. Это, в свою очередь, привело к снижению продуктивности животноводства. </p>
<p>•  Земледелие тоже продолжало развиваться экстенсивным путём, основное внимание уделялось не качеству произведённой продукции, а его валовому количеству. В результате себестоимость сельскохозяйственного производства неуклонно повышалась. </p>
<p>В 1988 г. был принят закон «О кооперации». Согласно этому документу, всем  желающим вести самостоятельное хозяйство предоставлялась полная свобода.  Начали создаваться экспериментальные кооперативы, прообраз крестьянских и  фермерских хозяйств. В 1990–1991 гг. лишь некоторые инициативные сельские  жители отважились взять в аренду землю, технику, долгосрочные кредиты и образовать самостоятельные крестьянские и фермерские хозяйства. На 1 января  1991 г. в республике было 4567 таких крестьянских и фермерских хозяйств. В  среднем на каждое хозяйство по 2 коровы, около 143 коз и овец, 3 лошади. Однако в условиях социалистического хозяйствования такие формы, как кооперативное, фермерское, крестьянское производство, в полной мере развиться не могли.</p>


               
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              )
            ],
          ),
        ),
      ]),
    )));
  }
}
