import 'package:flutter/material.dart';
import '../../style.dart';
import 'package:flutter_html/flutter_html.dart';

class Paragraph5 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: bgColor,
      appBar: AppBar(
        backgroundColor: appBarColor,
        title: Text('§5.Древние кыргызы. Тюркские каганаты'),
      ),
      body: SingleChildScrollView(
        child: Container(
          padding: EdgeInsets.all(10.0),
          child: Column(
            children: [
              Text(
                '§5.Древние кыргызы. Тюркские каганаты',
                style: paragraphBoldTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<p>Китайский историк Сыма Цянь (145–86 гг.  до н. э.) в своем труде «Ши цзы» (Исторические хроники»), 1 в. до н. э. сообщает, что в 201 г. до н. э. правитель хуннов  шаньюй Моде подчинил себе некоторые  независимые  племена  –  гяньгуней  или  цзяньгуней, динлинов, синли, кюйше.</p>
<p>Учеными  полностью  доказано,  что  гяньгунями  или  цзяньгунами (гэгунь, цигу, кигу,  чигу и другие варианты) китайцы называли  древних кыргызов.</p>
<p>Цзяньгуны – китайское название древних кыргызов. В переводе означает “железный народ”. В китайской летописи говорится о том, что в недрах  земли кыргызов было в избытке меди, железа, золота. Железо добывалось в  рудниках. К метеоритному (небесному или звездному) железу кыргызы имели особый интерес, так как из него изготавливались очень прочные виды боевого оружия. Согласно китайской летописи кыргызы строго хранили тайны  обработки железа. Небесное железо называлось цзяша (цзяса, зелязо, где «о»  в конце слова говорит о восхищении), поэтому китайцы называли кыргызов  «цзяньгунами» – железным народом. Споры вокруг этнонима «кыргыз» не утихают. Существуют народные и  научные варианты трактовки значения этого этнонима.</p>
<center>Народные варианты  встречаются в легендах:</center>
• «Кырк» (сорок) и «кыз» – «девушка» – потомки сорока девушек. <br>
• «кырк» (сорок) и «огуз» – союз сорока огузов.<br>
• «кыр» (скала) и «огуз» – огузы из горных, скалистых местностей. 

<center>Научные варианты</center>
• кырк + йус – кырк жуз (сорок сотен). В. Радлов. <br>
• Кырк + эр – кырк киши (сорок человек). Ахмед Тоган. <br>
• Кара + гыз – (черноволосый народ). Д. Айтмуратов. <br>
• Кыргуу – (кырк + суффикс множественного числа ыз). К. Петров. <br> 
• Кырк + огуз – (сорок огузов, точнее, южные или западные огузы).  Н. Баскаков. <br>
• Кыргын–Кыргыт–Кыргыз – (светлолицый, голубоглазый народ).  А. Кононов. <br>
• Кыргыз–Кырылгыс – (неистребимый, возрождающийся, постоянный,  непобедимый). А. Омуркулов. <br>
• Кырк ууз – (сорок ууз, точнее потомки сорока сыновей Ууз-хана) по  варианту эпоса «Манас». <br>
• Кыргыч – кыргыз – (воин-истребитель). Акай Кине. <br>
<br>
• Некоторые ученые этноним «кыргыз» считают топонимом, т. е. названием  определенной местности, где обитал данный этнос.  <br>
• Другие ученые считают политонимом, так как данное политическое образование состояло, возможно, из сорока племен.  <br>
• Третьи считают, что это могло быть антропонимом, т. е. связан с именем    основателя каганата или государства.<br>

<center><b>В исторических письменных источниках существуют разные мнения относительно прародины кыргызов.</b></center> 
• Одни считают родиной кыргызов Енисей. <br>
• Другие – район озера Хыргыз-Нур (Кыргызские озеро) в современной  Северо-Западной Монголии. <br>
• Третьи утверждают, что прародиной кыргызов в 1 в. до н. э. был регион  восточного Тенир-Тоо – территории севернее теперешних городов Манас,  Кара-Шаар в современном Восточном Туркестане, а также севернее горного хребта Боро-Хоро. Сторонники этой гипотезы считают, что:<br>

<p>В середине 1 в. до н. э. предводитель хуннов Чжи-Чжи укрепил свою  армию храбрыми кыргызскими воинами и с их помощью покорил  племена, проживавшие в районе нынешнего Минусинска на Енисее.  Именно тогда, основной костяк кыргызов поселился на своей новой  родине, где смешался с жившими там динлинами.</p>
<p>Русский  востоковед  Н. Аристов  полагает что енисейские и  тянь-шанские  кыргызы  были  единым  народом.</p>
<p>В  китайских,  позже  в  мусульманских письменных источниках упоминается, что у  кыргызов были голубые глаза,  рыжые  волосы  и  белый  цвет кожи.</p>

<center><b>Эпоха тюркских каганатов</b></center>
<p>Вторая половина 1-го тысячелетия характеризуется формированием и  развитием раннефеодальных тюркских государств на обширной территории  Южной Сибири, Казахстана, Средней и Центральной Азии. Это позволило  назвать данный период (VI – XII вв.) – древнетюркской эпохой.</p>
<p>Этноним «тюрк», «тюркут» (с китайской  транскрипции  «туцзие»)  впервые  упоминается в китайской летописи в 546 г.,  «тюрк» означало «сильный», «крепкий».</p>
<p>Племя  тюрок  образовалось  в  IV–V вв.  в  среде  хуннов, а главным местом  их расселения был Алтай.</p>
<p>В середине V в. тюрки находились в подчинении жуань-жуаньского (аварского) кагана, который  господствовал во всей Центральной Азии. Сформировав хорошо обученное войско, тюрки менее чем  за сто лет подчинили себе все алтайские племена,  а в 546 г. покорили народ теле (тегрег), населявший  Джунгарию.</p>
<p>В 552 предводитель тюрков  Бумын напал на  жуань-жуаней и  нанес им сокрушительный удар.</p>
<p>Победивший  Бумын  принял  верховный  титул  жуань-жуаней  «илигкаган» (великий каган). В Центральной Азии был образован Великий  Тюркский каганат (552–603 гг.). Ставка кагана размещалась на реке Орхон (Северная Монголия).</p>

<center><b>Завоевания тюрков</b></center>
<p>• К 558 г. тюрки завоевали Поволжье и Приуралье, где подчинили угорские  племена. </p>
<p>• Тюрки поддерживали посольские связи с северо-китайскими государствами. Позже два северокитайских государства стали данниками тюркского  кагана. </p>
<p>• 565 г. тюрки нанесли сокрушительное поражение эфталитам, владения  которых охватывали громадную территорию – большую часть Средней  Азии, Афганистан, Северо-Западную Индию и государства – оазисы Восточного Туркестана. </p>
<p>• В 569 г. тюркские войска вступили в пределы территории Ирана, но не  смогли захватить иранские укрепленные крепости и города. Однако в  571 г. шах Ирана Хосров был вынужден заключить мирный договор с Истеми каганом и согласился выплачивать ему дань. </p>
<p>• В 576 г правитель тюрок Тюрксанф, сконцентрировав необходимые силы,  напал на Византию, расположенную вдоль Черного моря и овладел Босфором. </p>
<p>• В 580 г. тюрки вторглись в Крым и окружили Херсонес. </p>

<p>Так, Тюркский каганат, центр которого находился в Тенир-Тоо, превратился в могучую евроазиатскую державу.</p>

<center><b>Структура власти и система управления древнетюркского каганата.</b></center>
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset(
                  "assets/images/paragraphs/ancient-turkish-kaganate-power-structure.jpg"),
              SizedBox(height: 12.0),
              Image.asset(
                  "assets/images/paragraphs/great-turkish-kaganate.jpg"),
              Text(
                "Великий Тюркский каганат (552–603 гг.).",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              SizedBox(height: 12.0),
              Html(
                data: """
•  Титул и должность кагана означали «верховный правитель», «главный хан  тюркского народа» и, как правило, к высшему титулу прибавлялся компонент  имен собственных, иногда еще геройское имя или прозвище. Вопросы войны  и мира были прерогативой кагана, по его воле решается битва или союз в интересах «тюркского эля». Военные и дипломатические прерогативы кагана  были абсолютными, однако ими не исчерпывались его функции. Кроме того,  он осуществлял функции главы гражданского управления в самом каганате,  одновременно являясь старшим и в генеалогической иерархии родов и племен,  выступая в качестве вождя, верховного судьи и верховного жреца.
<br>
<p>В верхнем эшелоне власти стояли самые ближайшие помощники кагана  ябгу и шады и назначались, как правило, сыновья кагана и непосредственно управляли левым и правым крылом войск. Ябгу занимал первое место в  системе высшей иерархии тюркского каганата и, как правило, на эту должность назначался один из ближайших родственников кагана, в данном случае брат или сын.</p>
•  Из числа ближайших помощников кагана в управлении государством назначались «буюруки», которые непосредственно исполняли волю кагана и считались младшими чиновниками в ставке кагана. Вассальные князья, признавшие  политическую власть тюрков, носили титулы «эльтебер» и «иркин», которые  были предводителями и военачальниками крупных племен, в частности, карлуков, уйгуров, азов, согдийцев и других. <br>
• «Беки» занимали особое место, поскольку управляемые ими племена составляли ядро войск, сами беки составляли основной костяк военачальников и глав  родов общин и племен. Именно от их преданности зависела судьба кагана и  государства.

<center><b>Распад Великого Тюркского каганата</b></center>
• Разразившаяся гражданская война в Тюркском каганате в 583–584 гг. связана с усилением удельных ханов в лице Торэмена, Кара-Чурин Тардуш  хана, Тамган-хана (Турксанф), Тегин-шада с одной стороны, а с другой –  Ышбара-кагана, который пытался присоединить их владения и напал на их  аймаки (584 г.), чем вызвал недовольство удельных ханов. <br>
• Кровавые межплеменные распри подорвали силы Тюркского каганата, что  резко изменило его внешнеполитические позиции.  <br>
– За этот период раздробленный Китай, плативший дань тюркам, успел  в 581 г. объединиться под эгидой династии Суй.   <br>
– Другой вассал – Иран – в 588 г. в битве под Гератом нанес тюркам  тяжелое поражение.  <br>
– Византия освободила от тюрок Босфор.<br><br>
• В конечном итоге, междоусобная война в каганате, продолжавшаяся в течение 20 лет, привела к распаду каганата в 603 г. на две части: Восточную  и Западную.

<center><b>Древнетюркская культура</b></center>
<b>Жилище:</b><br>
• Древние тюрки вели кочевой образ жизни, их жилищем была юрта. Вход в  юрту находился с восточной стороны.<br>
<b>Письменность:</b><br>
• В начале древние тюрки пользовались согдийским курсивным письмом, в конце VI в. согдийские графемы были приспособлены для передачи  тюркской речи. Древнетюркский алфавит возник в VII в. и состоял из 38  знаков, геометризированных очертаний и был хорошо приспособлен для  фиксации на камне, дереве, металле.<br>
<b>Мифология:</b><br>
• Среди древних тюрков был широко распространен миф о сотворении мира. Согласно надписям вначале были сотворены «голубое небо» и «бурая земля», а затем между ними возникли «сыны человеческие». В древнетюркских надписях упомянуты «три бытия (мира)», что соответствует верхнему, среднему и нижнему мирам в мифологии тюркоязычных народов.<br>
<b>Религия:</b><br>
• К высшему уровню относится Верховное божество – Тенгри (небо), которое принадлежало верхнему миру. Ко второму уровню относится божество  Умай, это божество олицетворяло женское начало и являлось покровительницей детей и хранительницей домашнего очага. К третьему уровню относится божество Идук Йер-Су, по представлению древних тюрков, оно  обитало в средней зоне Вселенной и покровительствовало Родине (ЗемлеВоде), где жили Тюрки. К культу Йер-Су примыкал и культ гор. <br>
•  К четвертому уровню относиться Эрклиг – Бог нижнего мира, подземного  царства, разлучающий людей, враждебный верхнему миру. Кроме этого,  древние тюрки поклонялись огню, верили в его очистительную силу<br>

<b>Искусство:</b><br>
• К произведениям искусства тюрков можно отнести изделия из металла,  гравировку по кости, каменные изваяния и наскальные рисунки. Кроме  стелл были и сложные статуи с показом: детали человеческих тел, оружия,  поясных блях, частей одежды, посуды и т. д. <br>

<center><b>Из истории Западно-Тюркского каганата</b></center>
<p>Западно-тюркский каганат достиг своего расцвета при каганах Шегуе  (годы правления 610 – 618) и Тон-джабгу (правил с 618 по 634 гг.), это время  максимальной территориальной экспансии этого каганата. </p>
<b>Состоял народ из двух крупных объединений:</b>
1. В конфедерацию нушуби входило  пять  племен,  которые  владели территорией от берегов Сыр-Дарьи до реки Чу.<br>
2. Другие пять племен, объединенные под общим наименованием <b>дулу</b>занимали земли от реки Чу до Алтая и Джунгарии.<br><br>
В состав Западно-Тюркского каганата входили Восточный Туркестан, земледельческие  регионы Средней Азии, обширные степные пространства Приаралья и Северного Кавказа. Административно-политическим центром государства был сначала город Мин-Булак  (близ. сов. г. Чымкента, Казахстан), а с 618 г. – город Суяб (развалины городища Ак-Бешим  близ современного Токмака).

<center><b>Реформаторы Западно-Тюркского каганата.</b></center>
<p><b>Тон Джабгу-каган</b> (годы правления 618 – 634 гг.) провел  реформы  в  целях  усовершенствования системы управления и укрепления  центральной власти; установил размер  уплаты дани с подвластных владений  от  Исфиджаба  и  до  северо-западной  Индии. Покорные местные правители  получили титул эльтебер и были переведены на положение наместников, к  ним были приставлены тутуки (уполномоченные кагана) для сбора дани.</p>
<p>Ышбара Хилаш-каган (годы правления 634 – 638 гг.) провел военноадминистративную реформу, разделив каганат  на «десять стрел», закрепив законодательным  путем существование Западнотюркского каганата на десять частей, называемых стрелами  (или «он ок бодун»), т. е. «десятистрельным  народом». Данная реформа предполагала усилить действенность системы «десяти стрел»,  для этого все вожди племен и родов назначались каганом в качестве «управляющих» на  местах, и зависимых лично от него.</p>
<p>Однако,  введенные обоими каганами новшества не достигли своих целей, по той простой  причине, что противостояния между центральной властью и племенными вождями были  слишком велики, для того чтобы их интересы совпали.</p>
<p>В 630 г. Западно-тюркский каганат вступил в полосу тяжелых внутренних противоречий. Ожесточенная грызня за власть вскоре переросла в межплеменную  борьбу двух главных племенных союзов – нушиби и дулу.</p>
<p>В конечном итоге, междоусобная война закончилась размежеванием  конфедерации. Согласно заключенному договору в 638 г. при р. Или, земли  от реки на запад стали владением Дулу-хана, а к востоку от нее стали владением Хилаш-хана. С этого времени Западно-тюркский каганат фактически  был разделен на два царства, в результате с каждым годом все больше и больше утрачивал свое былое могущество.</p>

<center><b>Тюргешский Каганат (699 – 766 гг.).</b></center>
<p>Прежде тюргеши подчинялись западнотюрским каганам и входили в  конфедерацию дулу, и населяли долины между реками Или и Чу.</p>
<p>В конце VII в. (699 г.) вождь тюргешей Уч-илиг, выступил против последних западнотюркских каганов – ставленников китайского двора и установил свою власть на всей прежней территории Западнотюркского каганата. Еще в VII в. тюргешские рода делились на желтых (сары) и черных  (кара). Сары-тюргеши были старшей ветвью, а кара-тюргеши младшей.  Представители этих ветвей постоянно враждовали друг с другом.</p>
<p>В конце VII – начале VIII вв. усиление Восточно-Тюркского каганата  беспокоило всех, в том числе китайскую империю Тан. Восточно-Тюркский каганат достиг наибольшего своего могущества в период правления кагана Капагана (691–716 гг.). Восточнотюркские военачальники,  опираясь на созданную каганом большую и сильную армию, предприняли попытку восстановить границы Великого Тюркского каганата. </p>
<p>Серьезным препятствием  на пути реализации этих планов явилась образованная в 710 г. Тройственная коалиция, в которую вошли Танский  Китай, Кыргызский каганат на Енисее и Тюргешский каганат в ТенирТоо. Это антитюркская коалиция была создана в результате активной  дипломатической  деятельности Барсбека.</p>
<p>• Однако каган Капаган решил упредить события и осуществил хитрый маневр. </p>
<p>• Заключив договор с Танским Китаем, он вывел его из коалиции, т. е. обеспечил его нейралитет. </p>
<p>• Затем восточные тюрки, несмотря на суровые зимние условия, перешли  через Саяны в конце 710 г. и в начале 711 г. внезапно вторглись во владения  енисейских кыргызов и разгромили их. </p>
<p>• Быстро реагируя на изменившуюся обстановку, Капаган тайными тропами через Алтай переправил войска на другой берег Иртыша. В 711 г. на  р. Болучу в Джунгарии восточные тюрки разбили многочисленную армию  тюргешей. Сакал-каган с братом были казнены. После этого тюргешский  каганат на некоторое время перестал существовать (711–715 гг.). </p>
<p>• В 712 г. войсками Капагана была разбита 120-тысячная китайская армия в  Маньчжурии. Это победа была вершиной тюркского военного могущества. </p>

<p>В 717 г. тюргеши добились независимости, их правителем был каган из  «чёрных» тюргешей Чабыш-Чор Сулук (717–738 гг.). Новый каган оказался искусным дипломатом. Он в 717 г. совершил поездку  в Китай, где  признали легитимность его власти, затем заключил ряд династийных  браков с родом Ашина, а также с Восточнотюркским каганатом и Тибетом. Таким образом, Сулук-каган сумел обезопасить восточные границы  Тюргешского каганата.</p>
<p>На Западе Сулук–каган поддерживал антиарабское движение в Согде,  Бухаре, Чаче (Ташкентский оазис) и Фергане, и тюргеши предстали мощным  заслоном против арабской агрессии.<br> 
• В 737 г. в битве с арабами Сулук-каган потерпел поражение. От сильных  переживаний кагана разбил паралич, и в 738 г. он умер. По другой версии  Сулук-каган был убит Бага-тарканом, главой «желтых» тюргешей, который положил конец двадцатилетней борьбе за власть между «желтыми» и  «черными» тюргешами, закончившейся распадом Тюргешского каганата. </p>

<center><b>Карлукский каганат (744–940 гг.)</b></center>
<p>Карлуки – тюркоязычные  племена  состоявшие  из  трех  племенных  групп: ташлык, булак, чигиль. Первое упоминание о карлуках появилось в  китайских источниках, в начале VII в. Согласно источникам, с самого начала карлукский союз характеризовался территориальной и политической  раздробленностью. Их правитель носил титул «джабгу». Первоначальным 
местом расселения карлукских племен были области между Западным Алтаем и Тарбагатаем, кочевали на северо-западе от Бейтина (Бешбалык), от  Алтайских гор на запад до р. Иртыш.</p>
<p>В 744 г. объединенные силы уйгуров, басмылов и карлуков разгромили  Второй Тюркский каганат. Образовалось новое степное государство – Уйгурский каганат (744–840 гг.). Однако карлуки оказались в подчинении  прежних союзников. Это вызвало недовольство карлуков, стремившихся к  самостоятельности.</p>
<p>В 746 г. карлуки, притесняемые уйгурами, были вынуждены перекочевать в Семиречье. Политическая обстановка здесь была очень сложной.  Власть Тюргешского кагана была парализована. Этим не замедлила воспользоваться китайская династия Тан. В 748 г. стотысячная китайская армия  вторглась в Чуйскую долину, захватила город Суяб и подвергла его разрушению. В следующем году был захвачен и повешен аким Чача (Ташкента). Активную помощь китайцам оказывали карлуки. Имевшие интерес в регионе  арабы не могли допустить укрепления здесь позиций китайской империи.  Стотысячная армия арабов под командованием Зияд ибн Салиха выступила  против китайского полководца Гао Саньчжи.</p>
<p>Два войска сошлись на берегу р. Талас в июле 751 г. у города Атлах. Четыре  дня армии не решались перейти разделявшую их реку и начать действия. На  пятый день конница карлуков неожиданно нанесла удар по тылам китайцев.  Арабы бросились в лобовую атаку. В итоге танское войско потерпело сокрушительное поражение.</p>
<p>Данное сражение между сильными державами того времени, как Танская  империя и Арабский Халифат, имело историческое значение. Предотвращена дальнейшая экспансия Танской империи. Победа арабо-тюркского войска  обусловила  в  регионе  развитие  мусульманской культуры.  После  битвы  арабы не смогли удержаться в Западном Притяньшанье. Карлуки, сыграв  важную роль в разгроме китайских захватчиков упрочили свое положение  в Семиречье.</p>
<p>На протяжении целого столетия среди карлуков Тенир-Тоо, Семиречья и  Восточного Туркестана шел процесс объединения вокруг династии Караханидов.</p>
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/era-of-turkish-kagans.jpg"),
              Text(
                "Эпоха тюркских каганатов (VI–VII вв.)",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
            ],
          ),
        ),
      ),
    );
  }
}
