import 'package:flutter/material.dart';
import '../../style.dart';
import 'package:flutter_html/flutter_html.dart';

class Paragraph6 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
            '§6.Борьба кыргызов за господство в Центральной Азии. Кыргызское великодержавие'),
      ),
      body: SingleChildScrollView(
        child: Container(
          padding: EdgeInsets.all(10.0),
          child: Column(
            children: [
              Text(
                '§6.Борьба кыргызов за господство в Центральной Азии. Кыргызское великодержавие',
                style: paragraphBoldTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<center><b>Государство енисейских кыргызов</b></center>
<p>В конце VII в – начале VIII в. на Енисее усилилась роль кыргызского государства на политической арене. Эти обстоятельства способствовали тому,  что с кыргызским государством были  вынуждены считаться все более или  менее значимые сопредельные страны.</p>
<p>Возглавлял кыргызское государство в тот период выходец из древней  кыргызской правящей династии ажо  Барсбек. В конце VII в. тюрки признали Барсбека правителем кыргызов  и заключили мир посредством династического  брака.  Однако,  Барсбек,  став зятем тюркского кагана, не  пожелал быть вассалом Восточнотюркского каганата.</p>
<p>В 689 г. Барсбек решив испытать  силы  кыргызов,  предпринял  важный  политический  акт  –  принял  титул  кагана  с  тронным  именем  Ынанчу Алп Бильге. Это был открытый  вызов  вождя  енисейских  кыргызов Тюркскому каганату, открытое соперничество с ним за господство в Центральной Азии.</p>
<p>Вскоре, Барсбек вступил в международный  тройственный  союз,  в  составе которого были танский Китай, Тюргешский  каганат, азы вместе с чиками.</p>
<p>Ажо – титул правителя енисейских кыргызов, а также клановое  имя правящего дома кыргызов в  VII–IX вв.</p>
<p>Азы  и  Чики  кочевые  племена,  которые были покорены восточнотюркскими каганами.</p>              
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Barsbek.jpg"),
              Text(
                "Барсбек.",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<p>Зимой 710–711 гг. тюркское войско во главе с полководцами Тон-Йокуком,  Могиляном и Кюльтегином совершило переход через Саяны и разгромило кыргызов. В жестокой битве в черни Сунга погиб кыргызский каган  Барсбек. Кыргызы были подчинены восточными тюрками.</p>
<p>Последствия  поражения  для  кыргызов  были  тяжелыми, так как они утратили на время государственное единство, прекратились на целое  столетие посольские связи  с внешним миром.</p>
<p>После падения Тюркского  каганата  возвысился  Уйгурский  каганат.  В  751 г.  Кыргызы  в  союзе  с  чиками,  огузами  и  карлуками  выступили против экспансии  уйгурского  кагана  Моюн-чура. Уйгурам  удалось  разгромить  летучие отряды кыргызов  и  кыргызское  государство  попало  в зависимость от Уйгурского  каганата,  а  кыргызский  правитель  утратил  титул  кагана.</p>              
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Sunga-battle.jpg"),
              Text(
                "Битва в черни Сунга.",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<center><b>Кыргызское Великодержавие</b></center>
<p>К началу IX в. Уйгурский каганат во многом растерял свою былую  мощь. Из-за усилившихся внутренних распрей, было подорвано и единство державы. Кыргызы не замедлили воспользоваться этой ситуацией.  «Ажо назвал себя ханом, а жену Геллу-шех (дочь карлукского джабгу)  провозгласил ханшей», – сообщали в связи с этим китайские источники.  Это важное в истории кыргызов событие произошло в 820 г. Заручившись поддержкой карлуков, кыргызы объявили о своей независимости  от Уйгурского каганата и тем самым вступили в борьбу за верховенство  в Центральной Азии. На этот раз их претензии были обусловлены реальными возможностями</p>
<p>Началом возвышения кыргызского государства стало восстание против уйгурского государства в 20-е годы IХ в., в период, когда обострились внутренние распри в Уйгурском каганате. Кыргызы готовились к  войне с уйгурами и тщательно произвели некоторые реорганизации в  армии. Cоздали образцовую военную структуру, состоявшую из ополчения отдельных родов и племён, а также гвардейских частей, входящих в  непосредственное введение племенных вождей. Основную силу составляла конница, в распоряжении которой были быстроногие и выносливые  кони. Глубоко проработанной была тактика ведения боя с использованием метода рассыпных атак, поэтапного введения в бой отрядов с лёгким  и тяжёлым вооружением, попеременных атак и отступлений для заманивания противника, а затем удара по флангам и тылу.</p>
<p>В целях централизации власти и преодоления племенного сепаратизма,  укрепили военно-административную систему, ввели боевые единицы по  десятичному принципу.</p>
<p>Активизировали внешнеполитические связи, на протяжении двух поколений они заключили династийные союзы с правителями Тюргешского, а  затем Карлукского государств – главных противников уйгуров, стремясь  заручиться их военной поддержкой. Ажо кыргызов сумел наладить дипломатические отношения с враждебными уйгурам арабами и тибетцами. Необходимо отметить, что дипломатическая подготовка к войне была  проведена кыргызами на очень высоком уровне и обеспечила максимально-благоприятные условия для успешного ведения военных действий.</p>
<p>В ходе военных действий против своего кагана восстал полководец Гюйлу-  Мохэ из уйгурского племени эдизов, который с многочисленным войском  присоединился к кыргызам, и привел кыргызского  кагана в Орду-Балык.</p>
<p>Решающее сражение состоялось под Орду-Балыком в 840 г., уйгурское  войско было разгромлено, каган был убит, попавший в плен министр Гюйлофу был казнен. Город Орду-Балык был разрушен и сожжен. Уйгуры в  панике бежали от мести победителей в разных направлениях с территорий Монголии. Одна группа оказалась в Китае, другая в районе Кучи и  Карашара, третья, в предгорьях Притяньшанья.</p>
<p>Войско  кыргызов  насчитывало  30  тысяч  тяжело  вооруженных всадников и 70  тысяч  легких  кавалеристов  из вассальных племен.</p>
<p>В тех же китайских источниках говориться,  что к 842 г. кыргызам подчинялись татары,  обитавшие в Восточной Монголии и к югу от  пустыни Гоби, в Приалашанье, а также часть  районов Восточного Туркестана.</p>
<p>В 843 г. енисейские кыргызы, преследуя уйгуров, войско которых возглавлял Пан-Тегин, вторглись в Восточный Туркестан и захватили города  Аньси и Беш-Балык, а затем достигли границ Тенир-Тоо и Семиречья. Отряды кыргызов также провели успешные военные действия в Восточной Монголии, Джунгарии и за озером Байкал. Таким образом, к середине IX в. Уйгурский каганат в Монголии перестал существовать. Возникло новое Кыргызское Великодержавное государство.  В  китайских  источниках  приводится  довольно  исчерпывающее  описание его границ: «Хя-гасы (кыргызы) имели сильное государство, равное по величине владениям тюрок (имеется в виду Второй Тюркский каганат). На востоке оно простирается до озера Гулигань (Байкал), на юге – до  Тибета (Восточный Туркестан), на юго-западе – до Гэлоллу (Семиречье)».  Северные границы державы доходили до местностей, где располагаются  ныне города Томск и Красноярск.</p>
<p>
Кангай (Хангай) – долина  в Центральной Монголии  у подножия горы Хангай.<br>
Согласно древней степной традиции, народ, владеющий Кангаем считался формальным властителем всех кочевников  Центральной Азии</p>
<p>Численность енисейских кыргызов в тот период резко возросла. Если  учесть, что в 840 г. они выставляли против Уйгурского каганата стотысячное  войско, а также то, что по правилам тех времён тюркские племена выделяли от каждых 3–5 человек одного воина, то предположительное количество  кыргызов составляло от 300 до 500 тысяч. Следовательно, из множества племён Центральной Азии кыргызы занимали по численности второе место после уйгуров.</p>
<p>Нужно отметить, что когда кыргызы одержали победу над уйгурами, китайский  император много раз призывал кыргызского ажо вырвать с корнем уйгуров,  уничтожить их города. Однако кыргызский ажо ответил возмущённым отказом  на данный призыв императора. В результате чего в рамках степной кыргызской  державы уйгуры смогли вернуться к мирной жизни.</p>
<center><b>В результате возникновения Кыргызского Великодержавия:</b></center>
<p><b>во-первых</b>, надолго прекратились длительные междоусобные войны и распри  внутри Уйгурского каганата, что создало благоприятные условия для развития  Кыргызского Великодержавия;</b>              
<p><b>во-вторых</b>, Кыргызское Великодержавие стало надёжным заслоном на северных и западных границах Танской империи. Местные племена были избавлены  от постоянных набегов со стороны уйгуров;</p>
<p><b>в-третьих</b>, новые условия способствовали развитию, консолидации и укреплению кыргызского этноса. Целый ряд небольших племён влились в состав кыргызских. Например, часть сартов – представителей проживавших в Джунгарском  регионе тюркских племён – ассимилировалась с кыргызами и образовала племя  сарт. Часть татар, мангытов и ногоев, связанная общими предками с монголами,  вошла в состав кыргызского племени «шестьдесят родов». </p>              
<p>Таким образом, эпоха возвышения Кыргызского каганата на Енисее – это  время формирования феодальных отношений, в недрах которого зарождались  основы современной кыргызской нации. После выхода кыргызов на историческую арену в Центральной Азии, этноним «кыргыз» превратился в политоним  т. е. подчинённые племена восприняли самоназвание господствуюших кыргызов. По выражению Гардизи, «тому племени, которое собралось вокруг него, он дал имя кыргыз». После победы над Уйгурским каганатом в кыргызском государстве упорядочивается система политического устройства, формируется единый аппарат  управления.</p>
""",
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Kyrgyz-great-power.jpg"),
              Text(
                "Кыргызское Великодержавие.",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<center><b>1. Центральное управление осуществлялось следующими членами верховной ставки каганата:</b></center>              
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/kyrgyz-management.jpg"),
              Html(
                data: """
<center><b>2. На местах управления обеспечивали: </b></center> 
<p><b>тутуки</b> – управляли округами или большими родовыми объединениями, назначались каганом; <br>
<b>тарканы</b> –  командовали военными силами, назначались каганом; <br>
<b>бии (беки)</b> – управляли большими или несколькими малыми родами; <br>
<b>тютюны</b> – управляли мелкими родами, несколькими десятками или  сотней семей. </p>    

<center><b>Хозяйство енисейских кыргызов </b></center>
<p>• Хозяйство в кыргызском государстве было  представлено такими отраслями, как животноводство, земледелие, добыча и переработка руды, охота и  рыболовство. </p>
<p>• Население разводило быстроногих и выносливых лошадей, верблюдов, коров, и овец. Богатые имели по несколько тысяч голов скота, часть которого  содержалась в загонах. </p> 
<p>• Земледельцы выращивали пшеницу, просо, два сорта ячменя, коноплю.  Для орошения посевов ими использовалась сеть каналов и арыков. </p>
<p>• Стратегическим направлением хозяйства кыргызы считали добычу, производство и обработку железа. К железу с небес (метеоритному), кыргызы  имели особый интерес. Из выплавленного небесного железа кыргызские 
мастера изготавливали массивные кинжалы, боевые топорики , булавы, наконечники стрел и копий.  Кыргызы  обеспечивали  ими  всю  Южную  Сибирь. </p>
<p>• Мастера-кузнецы изготавливали большой ассортимент домашней утвари и орудий труда: сошники, бороны, серпы, мотыги, различные приспособления для обработки дерева, железа, цветных  металлов. Среди железных мастеров выделялись  чеканщики и ювелиры. </p>
<p>• Большого совершенства у кыргызов достигло производство  керамической  посуды.  Широкое  распространение получили изделия, такие как “кыргызская ваза” </p>
<p>• Енисейские  кыргызы  поддерживали  активные  торговые связи с другими народами через одно  из ответвлений Великого Шёлкового пути, пересекавшие  земли  каганата.Эта  ветвь  называлась  Кыргызским путём. </p>
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/paragraph6-pic.jpg"),
              Text(
                "Кыргызский воин. Ваза с тамгой. Охотник. Бляха седельной луки. Золотые сосуды с орнаментом.",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<center><b>Культура енисейских кыргызов </b></center>
<p>• Как установлено, в тот период кыргызы имели  свою письменность, определённая часть населения владела грамотой. Своим письмом оставляли  ряд ценных сведений. Сохранившиеся до наших  дней эпитафии (надмогильные надписи) на камнях зафиксировали важные исторические события  и даты. </p>
<p>• Кыргызы Енисея исповедывали религию бутпарас, т. е. были идолопоклонниками. Они признавали главным божеством Тенир-Ата, и Умай-Эне.  Кыргызы предавали своих покойников огню, считая его очистительным началом,  и верили, что  всё очищается в пламени огня. Они считали, что  огонь очищает умерших от скверны и грехов. </p>
<p>• Захоронения известных личностей представляли  собой высокий земляной холм, огороженный каменными столбами. Это место называлось “чаатас” (камень-воин – кырг. «жоокер таш»)</p>
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Sudjin-text.jpg"),
              Text(
                "Суджинская надпись.",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<p>Культуру енисейских кыргызов Чаа-тасского периода (VI–VIII вв.) ярко характеризуют материалы погребальных сооружений. Для енисейских кыргызов того периода был характерен погребальный обряд трупосожжения. Прах  умершего клали в керамическую урну или мешочек и хоронили в могильном  помещении (кырг. – казанак). Иногда урну с прахом помещали в бревенчатые (срубные) склепы. Захоронения известных людей представляли собой  высокий  земляной  холм.  Диаметры  этих  могильников  составляли  5 – 40  метров, высота 5 – 7 метров. Вокруг могильников сооружалась круглая или  прямоугольная ограда из выкопанных вертикально-каменных столбов. В археологической науке их называют «чаа-тас» (камень-воин – кырг. жоокерташ). В могилы ставили горшки с пищей, конское снаряжение, орудия труда  и быта, оружие и украшения, считая, что они будут нужны умершему в загробной жизни. Найденные украшения очень изящны и красивы, изготовлены из дерева, кости, кожи, войлока, бронзы, серебра и золота. Археологические исследования в разных частях Енисея выявили множество стоянок,  наскальных рисунков и надписей, орудий труда, быта и т. д. Памятники этого периода характеризуют высокую культуру енисейских кыргызов.</p>
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Chaa-tas.jpg"),
              Text(
                "1. Чаа-тас. 2. Курган в разрезе.",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
            ],
          ),
        ),
      ),
    );
  }
}
