import 'package:flutter/material.dart';
import '../../style.dart';
import 'package:flutter_html/flutter_html.dart';

class Paragraph16 extends StatelessWidget {
  @override 
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('§16.Суверенная Кыргызская Республика'),
        ),
        body: 
        SingleChildScrollView(
          child:
        Container(
          padding: EdgeInsets.all(10.0),
          child:
          Column(
            children: [
              Text('§16.Суверенная Кыргызская Республика', style: paragraphBoldTextStyle, textAlign: TextAlign.center),
              Html(data: """
<center><b>Распад СССР</b></center>
<p>•  В марте 1990 г. III Съезд Народных депутатов СССР ввел институт президентства. Установление новой формы правления было обусловлено целым рядом  коренных демократических преобразований, объективной эволюцией межнациональных отношений, введением многопартийности и развитием плюрализма в обществе. С ликвидацией командно-партийной системы,  КПСС была  отстранена от власти, и все её полномочия переданы Советам. </p>
<p>•  С введением президентской власти в СССР этот институт был принят в Казахстане, Узбекистане и ряде других союзных республик. 27 октября 1990 г. на  сессии Верховного Совета Кыргызской ССР первым Президентом Кыргызстана на альтернативной основе был избран Аскар Акаев.</p>
<p>В сложившихся обстоятельствах стали требовать независимости не только  союзные республики, но и малочисленные народности. 15 декабря 1990 г.  Верховным Советом Кыргызской ССР была принята «Декларация о государственном суверенитете Республики Кыргызстан». В декларации отмечалось, что народ Кыргызстана составляют граждане республики - представители всех проживающих в ней национальностей и что государство  гарантирует всемерную заботу о сохранении и развитии их культур, языков,  обычаев и традиций. Декларация провозглашала также многообразие видов  собственности и их равноправие перед законом.</p>
<p>•  В ходе обсуждения принципов государственной суверенности Кыргызстана  высказывалось много предложений о реорганизации и укреплении государственной власти. В результате было решено разделить её на три ветви – законодательную, исполнительную и судебную.</p>
<p>31  августа  1991 г.  сессия  Верховного  Совета  Киргизской  ССР  приняла  <b>«Декларацию о государственной независимости Республики Кыргызстан»</b>, которая торжественно провозгласила, что Кыргызская Республика  является независимым суверенным демократическим государством. Итак,  на  карте  мира  появилось  новое  независимое  суверенное  государство  –  <b>Кыргызская Республика.</b></p>
<p>•  В обстановке гражданского и патриотического подъема 12 октября 1991 г. всенародным голосованием А. Акаев был избран Президентом Кыргызской Республики. </p>
<p>• 8 декабря 1991 г. Республика Беларусь, Российская Федерация и Украина  подписали в Беловежской пуще близ г. Минска Соглашение о создании <b>Содружества Независимых Государств (СНГ)</b>. Это событие положило начало процессу распада СССР, принявшему необратимые формы. 21  декабря 1991 г. в г. Алматы соглашение об образовании СНГ подписали  Республика Беларусь, Российская Федерация, Украина, Азербайджан, Армения, Грузия, Казахстан, Кыргызстан, Молдавия, Таджикистан, Туркмения и Узбекистан. Это означало, что СССР окончательно прекратил свое  существование. В связи с расформированием СССР М. С. Горбачёв 25 декабря 1991 г. объявил о сложении с себя полномочий президента.</p>

<center><b>Причины распада СССР </b></center>
– глубокий экономический и политический кризис, падение жизненного  уровня населения;  <br>
– кризис коммунистической идеологии;  <br>
– обострение межнациональных отношений, развитие тенденции к национальной независимости и сепаратизму;  <br>
– развитие  национальных  фронтов,  движений  по  выходу  из  состава  СССР;  <br>
– заинтересованность крупных держав запада в демократических переменах в СССР;  <br>
– поддержка  со  стороны  Запада  демократических  и  национальных  фронтов;  <br>
– выход прибалтийских республик из состава СССР (март 1990);  <br>
– парад суверенитетов союзных республик (1990 г. ) и др. 

<p>• Образование суверенной Кыргызской Республики стало величайшим событием в истории кыргызского народа и явилось  следствием кардинальных реформ общественно-политической системы СССР. С приобретением  суверенитета Кыргызстану необходимо было, в первую очередь определить принципы своего государственного устройства, внутренней и внешней политики. Для этого нужно было разработать и принять Конституцию  республики. </p>
<p>• 5 мая 1993 г. XII сессия Жогорку Кенеша после всестороннего обсуждения  утвердила новую Конституцию Кыргызской Республики. Этот день отмечается в Кыргызстане как всенародный праздник. </p>
<p>• Конституция в соответствии с волей и интересами народа Кыргызстана  определила общественный строй и политические принципы Кыргызской  Республики, центральные органы всех ветвей государственной власти,  их построение и деятельность, основные права и обязанности граждан  республики.</p>
<p>Конституция определяет Кыргызскую Республику (Кыргызстан) как суверенную,  унитарную, демократическую республику, построенную на началах правового,  светского государства; суверенитет Кыргызской Республики распространяется на  всю ее территорию; народ Кыргызстана является носителем суверенитета и единственным источником государственной власти Кыргызской Республики; народ  осуществляет свою власть непосредственно и через систему государственных  органов на основе Конституции и законов Кыргызской Республики; от имени народа вправе выступать избранные им Жогорку Кенеш и Президент.</p>
<p>• В пределах полномочий, установленных Конституцией, государственную власть в Кыргызской Республике представляют и осуществляют  Президент  Кыргызской  Республики,  Жогорку  Кенеш,  Правительство  Кыргызской Республики и местные государственные администрации,  Конституционный суд, Верховный суд, Высший Арбитражный суд, суды  и судьи системы правосудия. Законотворческие, исполнительные и судебные органы исполняют свои функции самостоятельно и во взаимодействии. Президент как глава государства обеспечивает единство всех  ветвей власти и является гарантом Конституции, прав и свобод человека  и гражданина. </p>
<p>• Большую работу Жогорку Кенеш проделал для утверждения <b>Государственного Флага</b> (3 марта 1992 г.), <b>Государственного Гимна</b> (18 декабря  1992 г.) и <b>Государственного Герба</b> (14 января 1994 г.) Кыргызстана. </p>

<center><b>Экономическая жизнь суверенного Кыргызстана </b></center>
<p>• Несмотря на обретение политической самостоятельности Кыргызстан в  экономическом отношении продолжал оставаться зависимым от других  государств. Это было обусловлено и тем, что промышленность республики в общесоюзном комплексе народного хозяйства, в основном специализировалась на поставках сырья и полуфабрикатов. Готовая же продукция  выпускалась в других регионах страны, и средства от её реализации вливались в союзный бюджет. С распадом СССР отработанные экономические  связи были нарушены, и республика оказалась в тяжелейшем материальном и финансовом положении. </p>
<p>• К концу 1991 г. средний рост промышленного производства резко снизился, средства, вложенные в строительные и аграрные комплексы, не окупились. Намеченные в энергетической, угледобывающей, машиностроительной, продовольственной отраслях и в лёгкой промышленности планы  остались нереализованными. </p>
<p>• В январе 1992 г. Российская Федерация провела радикальную либерализацию цен, установив свободный курс на продукцию топливно-энергетического комплекса, металлургической и машиностроительной отраслей. В  результате этого во всех странах СНГ, в том числе и в Кыргызстане, разразился очередной этап экономического кризиса. Производство в Кыргызстане в 1992 г. снизилось на 27%. Разрушились экономические связи, народное хозяйство впало в депрессию.  </p>
<p>• В этих условиях Правительство Кыргызской Республики разработало и  приняло программу экономических реформ. Это программа определяла  конкретные меры по приватизации, земельной реформе, социальной защите населения, государственным инвестициям и др. В качестве первостепенных задач необходимо было урегулировать макроэкономическую ситуацию, создать условия для стабилизации производства, поступательного  движения экономики.</p>

<center><b>Экономические реформы в Кыргызстане (1991-2010 гг.) </b></center>
<center><b>Направления реформы в промышленности: </b></center>
– Закрепление законом частной собственности на средства производства; <br> 
– разгосударствление и приватизация государственных предприятий;  <br>
– создание смешанных предприятий и акционерных обществ;  <br>
– ликвидация убыточных и нерентабельных предприятий и т. д. 

<center><b>Однако! </b></center>
<p>• В ходе приватизации народнохозяйственных объектов государству нанесен огромный материальный ущерб. </p>
<p>• Основными владельцами собственности стали представители административной номенклатуры . </p>
<center><b>Сельское хозяйство</b></center>
<p>• В результате проведения земельно-аграрной реформы в 1991–1998 гг. 515  колхозов, совхозов и других сельскохозяйственных предприятий Кыргызстана подверглись коренному реформированию, и на их базе создано 54,5  тыс. индивидуальных хозяйств, 367 сельскохозяйственных кооперативов,  318 коллективных крестьянских хозяйств, 47 акционерных обществ и 8  агрофирм. В 1998–2000 гг. планировалось провести приватизацию еще 113  колхозов и совхозов, 112 учреждений обслуживания и перерабатывающих  предприятий. В итоге проведённых реформ в экономической структуре  сельского хозяйства Кыргызстана фермерские, кооперативные и индивидуальные хозяйства заняли превалирующее положение. В результате проведения земельной и аграрной реформы были созданы экономические и  правовые основы для формирования рыночных отношений в агропромышленном комплексе республики:</p>
– образована основанная на индивидуальной, коллективной и государственной  собственности многоукладная экономика;  <br>
– ликвидирована монополия на производство, распределение и использование  сельскохозяйственной продукции;  <br>
– с введением частной собственности созданы необходимые условия для повышения результативности производства;  <br>
– открыты широкие возможности для конкуренции в использовании передовых  методов ведения хозяйства и достижений научно-технического прогресса, в  улучшении качества продукции; <br> 
– повышена ответственность фермеров и крестьян при производстве продукции, появилась личная заинтересованность в эффективном ведении хозяйств.

<center><b>Однако! </b></center>
<p>Наряду с достижениями в ходе реформы был допущен ряд просчётов и недостатков, появились новые трудности и проблемы:<br>
– обескровлена материально-техническая база сельского хозяйства, разрушены и  расхищены техника, оборудование, сельскохозяйственные здания и сооружения;  <br>
– катастрофически снизилась производительность, в результате упала рентабельность и доходность сельского хозяйства;  <br>
– образовался большой дефицит средств на приобретение сельскохозяйственных  машин и оборудования, семян, удобрений, горюче-смазочных материалов и т. п.;  <br>
– заброшены ранее использовавшиеся плодородные земли;  <br>
– в сельской местности широко распространились безработица и бедность среди населения;  <br>
– появились трудности в реализации выращенной продукции.</p>
<p>•  Начиная с 1998 г. земельно-аграрная реформа в Кыргызстане поднялась на новую качественную ступень. По результатам всенародного референдума была  введена частная собственность на землю. </p>
<p>•  А в августе 2001 г. Правительство Кыргызской Республики утвердило Положение о порядке купли-продажи сельскохозяйственных земельных участков.  Этим был сделан ещё один решительный шаг к ускорению перехода сельского  хозяйства республики к свободным рыночным отношениям.</p>

<center><b>Народные революции. Обновление государственной власти </b></center>
<p>• Для кыргызского народа характерны честность и справедивость. Он всегда  умел с достоинством вынести тяжелые испытания, выпавшие на его долю. <br>
В первые годы независимости было немало трудностей – ощущалась нехватка продовольствия, хлеба, но люди стойко переносили их, твердо верили в правильность выбранного пути. 
<p>• Ради справедливости надо отметить, что прежняя власть также проделала  значительную работу для создания независимого государства, усиления  его международного авторитета.</p>
<center><b>Главные причины Мартовской революции 2005 г. :</b></center>
– провал экономических реформ и обнищание народа;  <br>
– чрезмерная концентрация и укрепление  президентской власти;  <br>
– вмешательство родственников и ближайшего окружения президента в деятельность государственных и судебных органов; <br>
– нецелевое  использование  бюджетных  средств,  иностранных  кредитов  и  займов;  <br>
– подавление инакомыслия, оппозиции, контроль СМИ;  <br>
– регулярная фальсификация результатов выборов;  <br>
– процветание коррупции во всех сферах общественной жизни; <br>  
– увеличение количества безработных и мигрантов и. т. д.

<p>• В марте 2005 года жители Джалал-Абадской, Ошской, Таласской областей  и Прииссыккулья поднялись против власти. Акции протеста охватили  Бишкек. 10 марта было создано движение «Народное единство», поставившее своей целью установление справедливости, проведение реформ  во всех сферах общества. 24 марта «Народное единство» организовало на  улицах Бишкека мирную демонстрацию. </p>
<p>• На площади «Ала-Too» его участников встретили сторонники президента А. Акаева. Противостояние грозило вылиться в кровопролитие. В такой исключительно сложной ситуации Президент А. Акаев оставил свой  пост и покинул Кыргызстан. Затем ушёл в отставку глава правительства  Н. Танаев. Таким образом, противостояние на площади «Ала-Too» привело участников мирного митинга к победе. </p>
<p>• На тот момент главным стал вопрос о новом главе и лидере государства.  Было понятно, что возвращение А. Акаева невозможно. Народ поручил  исполнять обязанности главы государства и правительства К. С. Бакиеву. Его поддержали также депутаты Жогорку Кенеша прежнего и нового созывов. Так произошло обновление – приход К. С. Бакиева к власти.  10 июля 2005 года состоялись выборы Президента республики, в которых  Курманбек Салиевич Бакиев одержал победу над своими соперниками.</p>

<center><b>Апрельская революция 2010 г. </b></center>
<center><b>Главные причины апрельской революции: </b></center>
– узурпация государственной власти;  <br>
– использование политической власти как средство для личного обогащения  президента и его ближайших родственников; <br> 
– подавление инакомыслия, гонение оппозиции, заказные убийства неугодных  лиц, запугивание журналистов, игнорирование общественного мнения;  <br>
– сращивание власти с криминальной структурой;  <br>
– масштабные афёры с банковскими счётами, ценными бумагами, отмывание  денег;  <br>
– Процветание коррупции во всех сферах общественной жизни, в производстве,  торговле, в силовых структурах, таможне, судебной системе, в высших эшелонах власти и т. д.

<center><b>Поводом для выступления против режима послужили: </b></center>
– повышение тарифов на электроэнергию на 100%;  <br>
– на коммунальные услуги и за тепло на 50%;  <br>
– повышение тарифов на сотовые связи;  <br>
– политика двойных стандартов, ложь, обман и.т.д.; <br>  
– арест лидеров оппозиционных групп и т. д. 
<p>• Были и другие грубые нарушения конституционных прав и интересов  граждан. Все эти действия породили недовольство в обществе, и люди 7  апреля 2010 года решили провести мирную акцию протеста. Вместо того  чтобы решать проблемы, власти приняли решение применить оружие против беззащитных людей.</p> 
<p>• В результате было убито 87 граждан, в том числе несовершеннолетних,  причинены телесные повреждения разной степени тяжести более чем 500  гражданам. Народные волнения охватили всю республику. Опасаясь гнева  народных масс К. Бакиев оставил свой пост и покинул Кыргызстан. Главой  государства и Временного правительства стала Роза Отунбаева.</p> 
<p>• Временное правительство приняло решение о проведении конституционной реформы в Кыргызстане. Конституционные реформы были направлены прежде всего на формирование правовых основ <b>парламентской республики</b>. 27 июня 2010 года на референдуме была принята новая  Конституция Кыргызской Республики. В результате наша республика отказалась от президентско-парламентской системы правления. На этом же  референдуме народ Кыргызстана поручил исполнять обязанности Президента переходного периода Кыргызской Республики Р. Отунбаевой. В  настоящее время в республике особое внимание уделяется качественному обновлению принципов формирования и механизмов эффективной деятельности Жогорку Кенеша как высшего представительного и законодательного  органа.  </p>
<p>•  30 октября 2011 года были проведены выборы Президента Кыргызской Республики. Кандидатами на высший государственный пост выступили 16 человек.  Все кандидаты на пост Президента выступили со своими программами. Населению республики были представлены все возможности для ознакомления с  этими программами. </p>
<p>•  В  ходе  выборов,  прошедших  на  демократических  принципах, более 62 % избирателей, принявших участие в выборах Президента Кыргызской Республики,  отдали свои голоса за <b>Алмазбека Атамбаева</b>. Таким  образом, действующий Премьер-министр был избран  на  должность  Президента  Кыргызской  Республики.  Инаугурация всенародно избранного Президента Кыргызской Республики состоялась 1 декабря 2011 года, и  Атамбаев Алмазбек Шаршенович официально вступил  в должность. По инициативе Президента КР А. Атамбаева разработана и принята <b>«Стратегия устойчивого развития Кыргызской Республики на период 2013–2017 годы»</b> (далее «Стратегия»).</p>
              """,
              defaultTextStyle: paragraphTextStyle,
              useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Atambaev.jpg"),
              Text("А. Атамбаев", style: paragraphTextStyle, textAlign: TextAlign.center,),
              Html(data: """
<center>«Стратегия» состоит из двух частей</center>
<p>Часть первая:  «Состояться как государство и заложить основы  успешного развития»</p>
<p>Часть вторая: «Приоритеты экономического  развития Кыргызской Республики на 2013-2017 годы»</p>
<p>• Главной целью данного документа является обозначение перед народом  реальной созидательной цели и придание позитивного импульса потокам  энергии, скопившейся и вырабатываемой в обществе.</p>
<center>В «Стратегии» определены первостепенные и долгосрочные задачи</center>
<p>• <em>Первостепенная</em> задача ближайших пяти лет – состояться как  государство и заложить основы  успешного развития Кыргызстана</p>
<p>• <em>Долгосрочная</em> задача – построить  сильный и независимый Кыргызстан, комфортный для жизни и инвестиций.</p>

<center><em>Задачи в политической  сфере:</em></center>
– формирование правового государства;  <br>
– обеспечение свободных демократических выборов;<br>  
– противодействие коррупции;  <br>
– формирование  работоспособной  системы  государственного  управления;  <br>
– реформирование судебных органов, обеспечение законности в их деятельности; <br> 
– формирование комплексной системы национальной безопасности;  <br>
– обеспечение военной безопасности;  <br>
– новое понимание внешней политики; 
<center><em>Задачи в социальной и духовной  сферах</em></center>
– реформа системы  образования;  <br>
– реформа здравоохранения;   <br>
– повышение эффективности социальной защиты населения и пенсионного обеспечения;  <br>
– формирование культурной среды, развитие спорта и поддержка молодежных инициатив;  <br>
– повышение роли семьи и обеспечение гендерного равенства;  <br>
– обеспечение межэтнического согласия, формирование гражданской  нации; <br> 
– оптимизация  государственно-конфессиональных  и  межконфессиональных взаимоотношений; <br> 
– обеспечение свободы слова и формирование государственной политики; 
<center>В «Стратегии» определены следующие приоритеты  экономического развития на 2013–2017 гг.: </center>
– устойчивый экономический рост и макроэкономическая стабильность;  <br>
– улучшение бизнес-среды и инвестиционного климата;  <br>
– развитие финансового сектора и т. д.
<center>В документе как стратегические отрасли экономики определены:</center>
• агропромышленный сектор<br>
• энергетика<br>
• горная добыча<br>
• транспорт и коммуникация<br>
• туризм и индустрия услуг
<center>Согласно  «Стратегии»  государственная  молодежная  политика будет осуществляться на основе следующих  принципов:</center>
– обеспечение прав и свобод молодых граждан;  <br>
– поддержка прогрессивных молодежных инициатив;  <br>
– учет интересов и потребностей различных групп молодежи, независимо  от пола, национальности, социального положения и религиозной принадлежности;  <br>
– адресная защита и поддержка социально уязвимой части молодежи, в том  числе детей с ограниченными возможностями здоровья, сирот, подростков  из многодетных и неблагополучных семей.
<center>Приоритетными направлениями реализации государственной  молодежной политики определены:</center>
<b>1) </b> патриотическое, нравственное и духовное развитие молодежи;  <br>
<b>2)</b> развитие созидательной активности молодежи и поддержка общественно–значимых молодежных инициатив; <br>
<b>3)</b> содействие обеспечению экономической самостоятельности молодых  граждан и реализации их права на труд; <br> 
<b>4)</b> формирование идей здорового образа жизни молодых граждан, воспитание и образование; <br>
<b>5)</b> информационная открытость;
<p>Основным аспектом молодежной политики является, включение молодежи во все процессы развития страны, открытие для  нее новых перспектив, горизонтов и «точек роста».</p>
        
              """,
              defaultTextStyle: paragraphTextStyle,
              useRichText: true,
              ),
            ],
          ),
        ),
        ),
    );
  }
}