import 'package:flutter/material.dart';
import '../../style.dart';
import 'package:flutter_html/flutter_html.dart';
import 'paragraph-header.dart';

class Paragraph8 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: Scrollbar(
            child: SingleChildScrollView(
      child: Column(children: <Widget>[
        ParagraphHeader("assets/images/article-pic8.jpg",
            "§8.Завершение процесса формирования кыргызской народности и его взаимоотношения с сопредельными народами"),
        Container(
          padding: EdgeInsets.all(10.0),
          child: Column(
            children: [
              Html(
                data: """
<center>Этнические процессы в эпоху древности</center>
<p>• Истоки  этнической  истории  кыргызов  восходят  к  глубокой  древности.  Кыргызская  народность  сложилась  главным  образом  на  базе  древних   и средневековых  племён  и  племенных  объединений  Тянь-Шаня  и  Притяньшанья. </p>
<p>• Процессы этнической консолидации и интеграции кочевого населения получили развитие в рамках военно-политических объединений, таких, как  сакский и усунский племенной союз. Это было полиэтничное образование,  включавшее племена саков, усуней и юечжей.  </p>
<p>• Этническая принадлежность усуней не установлена. Одни ученые относят  усуней к ираноязычным народам, другие их считают тюркоязычными. Их  потомками средневековые историки считали тюрков с голубыми глазами и  рыжими бородами.  </p>
<p>• С конца II в. до н. э. начался процесс ассимиляции местного сакского населения пришлыми кочевыми народами, мигрировавшими из глубин Центральной Азии, в том числе  юэчжами, усунями, хуннами и другими этническими группами. </p>
<p>• В ходе массовых переселений и смешения разных кочевых народов постепенно происходили изменения в этническом составе населения Семиречья  и Тянь-Шаня. </p>
<p>• С  появлением  хуннов  связано  начало  тюркизации  ираноязычных  кочевников. </p>
<p>• Переселение в середине VI в. на территорию Тянь-Шаня значительных  масс центрально-азиатских тюркских племён определило начало нового  этапа в этнической истории Кыргызстана.  </p>
<p>• Совсем иные этнические процессы протекали в Ферганской долине. Древние земледельцы Ферганы – чустские племена в рассовом отношении принадлежали к европеоидам длинноголового памиро-ферганского типа, а  по  языку относились к восточноиранской группе.   </p>            
<center>Этнические процессы в эпоху средневековья</center>
• Основным содержанием  этнической истории Тянь-Шаня в VI–VIII вв.    были взаимовлияния трех этнических компонентов:   <br>
– тюркских племён, недавнее прошлое которых было связано с Центральной Азией.<br>
 – дотюркского скотоводческого автохтонного населения <br>
– потомков сакских и усуньских племён  <br>
– согдийского (восточного - иранского) населения городов и осёдлых поселений, поддерживавшего постоянные связи. <br>
•  В VIII – X вв. завершается процесс полной  тюркизации скотоводческого населения Тянь-Шаня, он перешёл в новую фазу-процесс туркизации оседло-земледельческого населения Семиречья. <br>
•  Общим итогом этнических изменений на Тянь-Шане и в Семиречье в VI– XII вв.  было  образование  здесь  сложного  этносоциального  объединения  с  практически однотипными культурами внутри себя, и тесно взаимодействующими между собой оседло-земледельческой и кочевнической культурами.
<center>Проблемы этногенеза кыргызского народа </center>
<p>В историографии существует три направления в исследовании этногенеза и  этнической истории кыргызской народности. </p>
<p><b>Первая группа</b>. Кыргызский народ переселился (мигрировал) на территорию  Тенир-Тоо с верховий Енисея (из Минусинской котловины). Впервые это мнение высказал российский академик Г. Ф. Миллер (1705 – 1783 гг.) в своём труде  «История Сибири». И сегодня есть учёные, поддерживающие и развивающие эту  гипотезу. Они считают, что, появившись во второй половине первого тысячелетия до н. э., этноним «кыргыз» широко распространился в IX – X вв. по всей Центральной Азии от Енисея до Байкала и Алтая. Позднее, кыргызы перекочевали на  Тенир-Тоо, где в XVI в. и произошла окончательная их консолидация как народа.  А. Н. Бернштам выдвигает гипотезу о том, что кыргызы переселялись на ТенирТоо не одновременно, а поэтапно в течение 1300 – 1400 лет. Их первая миграция  была вызвана давлением на них хуннов с востока. Второй этап их переселения  на Ала-Тоо был связан с неоднократным массовым перемешиванием народов во  время образования и развития тюркских каганатов. Третий этап переселения, по  мнению А. Н. Бернштама, произошёл во время монгольских нашествий.</p>
<p><b>Вторая группа</b>. В XIX в. учёные Ч. Ч. Валиханов, Н. Я. Бичурин и Н. А. Аристов высказали независимо друг от друга мнение о том, что кыргызы не переселялись откуда-нибудь, они сформировались из племён, издревле живших на  Тенир-Тоо. Кыргызы являются автохтонным (местным) населением. Это мнение  последовательно излагалось в нескольких изданиях «Истории Киргизской ССР».</p>        
<p><b>Третье направление</b>, представленное работами К. И. Петрова, также исходит  из двух – трех этапов переселения кыргызского этноса из «Енисейско-Иртышского междуречья», но приурочивает их к более позднему периоду, охватывающему 300 – 400 лет.</p>
<p>XIV–XV вв. значительная часть кыргызов еще жила в Моголистане, населяя его  наименее доступные для неприятеля горно-лесные районы. Резкую особенность  кыргызов среди других племён Моголистана подчеркивает Мухаммед Хайдар.  Он отмечает, что кыргызы не подчинялись чагатаидам и не приняли ислам. </p>
<p>Этническое смешение монгольских племён с кыргызами произошло в сравнительно короткий исторический срок. Исследователи включают в число явно  монгольских и общие с монгольскими компоненты в составе кыргызов: баарын,  барак, дуулат, кереит, кушчу, монгол, монолдор, баргы, нойгут, меркит, булгачы.</p>
<p>Во второй половине XV – начале XVI вв. этноним «кыргыз», стал общим для  всех племён Кыргызстана. Таким образом, окончательно сформировалась кыргызская народность со своей территорией, языком, известной экономической и  культурной общностью.  </p>
<p>Анализируя направления и характер этнических процессов, оказавших влияние на становление кыргызского народа, известный специалист  по этнической истории кыргызов С. М. Абрамзон в своей книге «Кыргызы и их этногенетические, историко-культурные связи» пришел к следующим выводам:</p>
<p>1. Процесс формирования племён, из которого сложилась кыргызская народность,  происходил  преимущественно  на  территории  Восточного  Тенир-Тоо,  Внутреннего Тенир-Тоо, а также Памиро-Алая и прилегающих горных областей  (Алтай, Прииртышье, Восточный Туркестан). <br>
2. Основу складывавшейся в XIV–XVII вв. кыргызской народности составили: <br>
а) издавна обитавшие здесь местные тюркоязычные племена; <br>
б) группа пришлых, в основном тюркоязычных, племён центральноазиатского  происхождения; <br>
в) племена монгольского и казахско-ногайского происхождения.</p>

•  К концу XV – первой половине XVI вв. кыргызы устойчиво занимали определенную территорию, т. е. Семиречье, Центральной и Западный Тянь-Шань и  часть Южного и Восточного Притяньшанья, на этой территории происходил  этнический процесс от соплемённости к союзу племён.  <br>
•  Уже в XVI в., как и в более позднее время, кыргызские племена делились на  правое (он) и левое (сол) крыло (канат). Но если в XVI в. правое крыло подрезделялось на группу плёмен – потомков отуз уул (тридцать сыновей) и группу  племён Булгачи, то в более близкое к нам время под названием «отуз уул»,  большинство кыргызов объединяло оба крыла – и правое и левое, группа же  племён – потомков Булгачи, к которой причислялись и другие племена, получила название ичкилик.<br>



              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/ancient-kyrgyz.jpg"),
              SizedBox(height: 12.0),
              Image.asset("assets/images/paragraphs/kyrgyz-tree.jpg"),
              Html(
                data: """
<center><b>Роль Мухаммед-Кыргыза в консолидации кыргызов</b></center>
<p>• К началу XVI в. кыргызы Притяньшанья составили весьма внушительную силу, их кочевья доходили до Чалыша и Турфана на востоке. На юге  до Йанги-Гисара и на севере до Балхаша.</p> 
<p>• В это время среди кыргызов этнополитическая  консолидация набирала силу во главе с Мухаммед-Кыргызом. Он вошёл в кыргызские предания  под именем родоначальника кыргызов «Тагайбия».</p> 
<p>• Мухаммед-Кыргыз (Тагай-бий) руководствовался идеей-объединить все кыргызские племёна и  создать единое кыргызское государство. Он укрепил  объединения  «правого»  и  «левого»  крыла  кыргызских плёмен.</p> 
<p>• При  Муххаммед-Кыргызе  кыргызские  племена  стали  выступать  почти  как самостоятельное государственное объединение. Он принимал активное участие в политической жизни Моголистана. За оказанную поддержку  Султан Саид-хану Мухаммед-Кыргыз был признан вассалом могольского  хана.</p> 
<p>• Однако Мухаммед-Кыргыз продолжал политику самостоятельности и без  согласия Султан-Саида совершал набеги на города Мавераннахра, Таш</p>
кент,  Туркестан,  Сайрам. За это  своеволие  Султан-Саид  хан  был разгневан  на  Мухаммед-Кыргыза  и  повёл  против него  своё  войско  и  взял   его в плен (1517 г.) </p>
<p>• Султан Саид-хан из политических соображений был вынужден отпустить  Мухаммед-Кыргыза.  Мухаммед-Кыргыз  вновь  стал  независимо  управлять. Султан-Саид вновь совершил поход против кыргызов (1524 г.) и снова захватил Мухаммед-Кыргыза и отправил в Кашгар, где тот и находился  до  смерти Султан Саид-хана (1533 г.) Кыргызы в союзе с казахами сумели  отстоять свою независимость, и даже угрожали Кашгарии. </p>               
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Muhammed-kyrgyz.jpg"),
              Text(
                "Мухаммед-Кыргыз.",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<center><b>Кыргызы и калмыки </b></center>
<center>Кыргызско-ойратские отношения в XIV–XVII вв. </center>
<p>Распад Монгольской империи Юань и раздробленность Монголии в конце  XIV в. создали благоприятные условия для консолидации и усиления кыргызских племен. В качестве объединителя кыргызско-ойратских плёмен  выступают кыргызские правители Угэчи-Кашка и Эсэху-хан. Им удалось  установить своё господство над большей частью ойратов и монголов.  </p>
<p>• Владения кыргызских ханов Угэчи и Эсэху находились в районе Монгольского Алтая и Или-Иртышского междуречья. После смерти Угэчи (1415 г.),  ханом стал его сын Эсэху, который правил до 1425 г.  </p>
<p>• В середине XV в. было создано самостоятельное ойратское ханство в западной части Монголии. Постепенно усиливаясь, ойраты в XVI в. объединились в союз «Дербен ойрат» («Четыре ойрата»)</p>

<center>Ойраты (калмыки) – племена относящиеся  к «левому крылу» монголов. </center>
<p>• После объединения ойраты двинулись на запад, создавая реальную угрозу  владениям кыргызов и казахов. </p>
<p>• Большой вклад в укреплении кыргызско-казахской каолиции, в организацию действенного отпора ойратским завоевателям внесли Турсун-хан,  Кокум-бий, Манап бий, его сын Жарбан-баатыр, Чаа-бий, Тугел-бий и др. </p>

<center><b>Завоевательная политика Джунгарского ханства (1635 – 1758 гг. )</b></center>
<p>• В 1635 г. было создано новое государство ойрат-калмаков – Джунгарское ханство под властью хунтайджи (титул) Эрдени Батура (годы правления  1635 – 1653 гг.) Он укрепив свою власть начинает наступление на земли  казахов и кыргызов. </p>
<p>• В 1643 году многочисленное войско хунтайджи Эрдени Батура  двинулось  в сторону Казахстана и Кыргызстана, и на время захватило Таласскую и  Чуйскую долины. Объединенные силы кыргызов, казахов и узбеков плечом к плечу мужественно отражали натиск врагов и в 1644 г. нанесли по  ним решающий удар и вынудили отступить. </p>
<p>• В  1652 г.  состоялось  новое  крупное  вторжение  джунгаров  во  главе с  Цецен-ханом против тяньшаньских кыргызов и казахов. Превосходящие  силы калмаков вытеснили кыргызов и казахов с северной части ИссыкКульской, Чуйской долин в высокогорные районы Таласа, вглубь ТяньШаня, а некоторые части в сторону Ферганы. </p>
<p>• Ещё несколько походов против казахов и кыргызов калмыцкие захватчики  предприняли в период правления хунтайджи Галдан Бошокту (годы правления 1670 – 1697) сына Эрдэни Батура, джунгары установили контроль  над Восточным Туркестаном. Большинство пастбищ Северного и Восточного Тянь-Шаня было занято кочевьями калмыцких племён. </p>  
<p>• Начиная с 1644 г. уже самим калмыкам пришлось отстаивать свою независимость от посягательств маньчжуров, правящих в Китае. Война между  ними продолжалась до 1697 г., после провала восточного похода Галдан  Бошокту-хан покончил жизнь самоубийством в 1697 г.  </p>
<p>• Отношения кыргызов и казахов с джунгарами вновь резко обострились в  период правления Цеван Рабдана (1697–1727 гг.) и особенно с приходом  к власти Галдан Церена (1727–1745 гг.). </p>
<p>• В начале XVIII в., почувствовав ослабление Джунгарского ханства в войне против Маньчжуров, казахи и кыргызы предприняли попытку вернуть  утраченные территории. Однако в 1727 г. они потерпели поражение от  60-тысячной армии джунгарских захватчиков.  </p>
<p>• Большинство кыргызов, не желая покориться  чужеземцам, было вынуждено переселиться с севера на юг и на юго-запад Кыргызстана: на ПамироАлай и в Ферганскую долину.  </p>
<p>• На севере Кыргызстана (Кетмен-Тюбе, Тогуз-Торо, Нарын, Талас и др.) закрепились отдельные рода кыргызов, которые не прекращали борьбу против захватчиков. </p>
<p>• Джунгары, встретив на своём пути упорное сопротивление кыргызов и казахов, так и не смогли пробиться к Ташкенту, Сайраму, в Междуречье и к  городам Ферганской долины. </p>
<p>• Кыргызы, продолжая активные освободительные действия, сумели вернуть свои исконные кочевья еще до завоевания Джунгарии маньчжуро-китайской армией. </p>

<center>Кыргызы и Цинская империя </center>
<p>• Захватив  Восточной Туркестан, династия Цин переименовала этот регион  в Синьцзян (кит.: «новый край, новое владение»). Разгромив Джунгарское  ханство, правители Цинской империи вслед за Восточным Туркестаном  избрали новым объектом своей завоевательной политики Среднюю Азию. </p>
<p>• Первое столкновение кыргызов с китайскими захватчиками произошло в  1758 г. Цинский генерал Чжо Хой под предлогом преследования калмыков  прошёл через долину р. Или и, преодолев перевал Санташ, вошёл в ИссыкКульскую котловину. Всё население поднялось против врагов и после ряда  ожесточенных схваток вынудило их уйти восвояси. </p>
<p>• В 1759 г. кыргызско-узбекские силы нанесли сокрушительный удар по цинским войскам, вторгавшимся в Фергану. Из 9 тысяч китайских захватчиков было  уничтожено 7 тысяч. </p>
<p>• Непрерывная борьба народов Восточного Тюркестана продолжалась и после утверждения китайской гегемонии. Тюркское население (кыргызы,  уйгуры, казахи, узбеки и др.) в этой борьбе действовало сообща. В восстании 1814 и 1816 гг. в  Кашгаре активно участвовали кыргызы во главе  с Суранчы-бием.  </p>
<p>• Политика  национального  угнетения  и  грабежа  некитайских народов Синьцзяна привела к тому,  что в 1826 г. здесь вспыхнуло очередное крупное антицинское восстание  под руководством Джангер-кожо, которое охватило ряд районов Восточного Туркестана. Кыргызы активно поддержали восстание народов Синьцзяна пытавшихся свергнуть цинскую власть в Кашгарии. Однако это восстание было подавлено. Джангер-кожо нашёл убежище у Тайлак-баатыра.  В погоню за Джангер-кожо был направлен китайский отряд из 400 солдат  под командованием генерала Баян-Бату,  которой был разгромлен Тайлакбаатыром в ущелье Ойнок-Джар (совр. Ат-Башинский район). </p>
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Suranchy-biy.jpg"),
              Text(
                "Суранчы-бий.",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<center><b>Внешнеполитические контакты кыргызов и цинского двора </b></center>
<p>• Внешнеполитические контакты в соответствии с китайской традицией квалифицировались в Пекине, как отношения «сюзерена» (китайского двора)  с «вассалом». Формальным основанием для этого служила отправка кыргызскими биями ко двору императора, послов с подношениями «данью»  (кони, соколы). Однако за них вручались ответные дары.  </p>
<p>• Помимо ответных подарков, император «жаловал» кыргызским биям атрибуты чиновных званий. Почин этой практике был положен в 1758 г. когда по 
прибытии ко двору Нышаа-баатыра из рода солто, Черикчи Темир уулу от бугу  и сары-багышей, Тороке от чекир-саяков и Шукура от кушчу, им были вручены  знаки чиновного достоинства.  </p>
<p>•  Правители Китая вознамеривались заставить сопредельных кыргызов смириться с тем, что цинские отряды могут проходить через кыргызские кочевья,  не считаясь с их владельцами. Однако посольские связи между кыргызскими  биями и цинским двором оказались кратковременными. Прекращение их свидетельствовало о провале расчетов Пекина держать кыргызов в сфере своего  политического влияния. </p>             

<center><b>Кыргызско-казахские столкновения (вторая половина XVIII – сер. XIX вв. ) </b></center>

<p>•  После падения Джунгарского ханства, согласие между кыргызами и казахами,  плечом к плечу противостоявшими ойрат-калмыцким набегам на протяжении  XVII–XVIII вв., было поколеблено. </p>
<p>•  Причиной этому послужили споры между кыргызскими и казахскими феодалами за право владения  пастбищами  и  стойбищами,  освобождёнными  от  калмыков. </p>
<p>•  1760 г. султаны казахского Среднего жуза вторглись  во владения кыргызов и захватили большую добычу.  В ответ на это кыргызские феодалы в 1764 и 1765 гг.  трижды нападали на стойбища Старшего и Младшего жузов в долине реки Или, взяли в плен Аблай-хана  вместе с 17 султанами. Он был отпущен только через  три месяца. </p>
<p>•  В начале 70-х годов XVIII в. Кокжарлы-Барак совершает на кыргызов набег. Предводительствуемые  Эсенгул баатыром кыргызы на голову разгромили 20-тысячное войско казахов,  сам Барак погиб. После этого кыргызский батыр Эр-Садыр дважды нападал на  стойбища казахов и дошёл до Чолок-Коргона и Сузака (близ. совр. г. Чымкент). </p>
<p>•   В 70-е годы XVIII века Аблай-хан напал на таласских и чуйских кыргызов. В  сражении отличился народный герой Жайыл-баатыр из рода солто. В памяти  народа сражение между кыргызами и казахами сохранилось под названием «побоище Джаила». В схватках с казахскими захватчиками активно участвовали  Атаке баатыр, Бишкек баатыр, Бурго баатыр, Момокон и др.  </p>
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/Jayil-baatyr.jpg"),
              Text(
                "Жайыл-баатыр.",
                style: paragraphTextStyle,
                textAlign: TextAlign.center,
              ),
              Html(
                data: """
<center><b>Набеги Кенесары Касымова </b></center>
<p>• Предводители Младшего и Среднего жузов, пытаясь создать единое казахское государство, в 1841 г. возвели на престол своего ставленника Кенесары.</p>
<p>• В 1846 г. Кенесары направил послов к хану северных кыргызов Ормону с предложением объединиться в борьбе против надвигающейся угрозы экспансии русского царизма. </p>
<p>• Посоветовавшись  со  старейшинами  родов,  Ормон-хан ответил отказом. Недовольный Кенесары, первый раз, весной 1846 г. совершил набег  на владения солто и сарыбагышей, который сопровождался жестоким массовым насилием в отношении мирного населения.  </p>
<p>• В 1847 г. Кенесары во главе 20-тысячного войска  предпринял второй поход на чуйских кыргызов.  Убивая, громя и грабя все на своем пути, он дошел до местности Май-Тюбе (близ совр. г. Токмок). </p>
<p>• Кыргызские предводители во главе с Ормон ханом в ожёстеченном сражении разгромили войско захватчиков. Предводители казахов-Кенесары и  Норузбай – были взяты в плен, а затем убиты. В этой схватке погибли 32   казахских султана.  </p>
<p>• Спустя шесть месяцев после окончания войны, 22 августа 1847 г., при посредничестве российского правительства кыргызы и казахи подписали в  городе  Копал (совр. г. Талды-Коргон) мирный договор. Это бессмысленная, братоубийственная война вошла в историю кыргызского и казахского  народов как одна из самых трагических её страниц. </p>

              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              ),
              Image.asset("assets/images/paragraphs/kyrgyz-tribes.jpg"),
              Html(
                data: """
<p><b>1.</b> Адыгине.<br>
<b>2.</b> Багыш. <br>
<b>3.</b> Бугу. <br>
<b>4.</b> Басыз.<br>
<b>5.</b> Бостон. <br>
<b>6.</b> Жедигер. <br>
<b>7.</b> Китай. <br>
<b>8.</b> Кушчу. <br> 
<b>9.</b> Кипчак.<br> 
<b>10.</b> Кесек ават.<br> 
<b>11.</b> Монолдор.<br> 
<b>12.</b> Мундуз. <br>
<b>13.</b> Монгуш. <br>
<b>14.</b> Найман. <br> 
<b>15.</b> Нойгут. <br>
<b>16.</b> Саруу. <br>
<b>17.</b> Солто. <br>
<b>18.</b> Сарыбагыш. <br>
<b>19.</b> Саяк. <br>
<b>20.</b> Тейит. <br>
<b>21.</b> Черик.</p>       
              """,
                defaultTextStyle: paragraphTextStyle,
                useRichText: true,
              )
            ],
          ),
        ),
      ]),
    )));
  }
}
