import 'package:flutter/material.dart';
import 'package:flutter_html/flutter_html.dart';
import 'package:historybook/style.dart';

class Kurmanjan extends StatelessWidget {
  @override 
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("Курманжан Датка"),
      ),
      body: SingleChildScrollView(
        child: Container(
          padding: EdgeInsets.all(10.0),
          child: Column(
          children: <Widget>[
            Html(
              data:
              """
<center><b>Курманжан Датка</b></center>
<p>
Биография Курманджан (1811-1907 гг.) по-своему романтична. Ро­дилась она в семье простого кыргы-за-кочевника из рода монгуш на Алае. На восемнадцатом году ее вы­дали замуж за человека, которого она впервые увидела в день свадь­бы. Он ей не понравился, и она, во­преки традициям и религиозным канонам, осталась жить в юрте отца.
В 1832 г. энергичный феодал Алымбек, получивший от коканд-ского хана титул датки и управление всеми кыргызами Алая, освободил Курманджан от «брачного контрак­та» и женился на ней. Курманджан стала хорошей помощницей мужу и в его частое отсутствие (он вскоре стал приближенным, а затем и пер­вым визирем хана) несла бремя пра­вительницы Алая. После смерти Алымбека в 1862 г. Курманджан, отомстив убийцам своего мужа, стала полноправной правительницей Алая. Бухарский эмир Музафар и ко-кандский Худояр-хан присвоили ей почетное звание датки (равноцен­но чину генерала царской армии), «... снабдив ее надлежащим ярлыком и одарив подарками». Вынужденная смириться с поражением повстан­цев после падения Кокандского ханства, Курманджан перешла на службу к царю, призвала к этому своих сыновей и все население Алая, который летом 1876 г. был присоединен к России. На этой тер­ритории было образовано 5 волос­тей: Кичи-Алайская, Наукатская, Гульчинская, Узгенская и Ак-Бурин-ская, которые вошли в состав Ош-ского уезда. Ими стали управлять сыновья Курманджан-датки: Омор-бек, Камчибек, Асанбек и Батырбек.
Политическим завещанием зву­чит одно из ее писем ферганскому военному губернатору Ионову
«... Когда Ферганское мусульман­ское государство (т.е. Кокандское ханство) не признавало еще России, я воевала и спорила с Вами. В это время на Алай ошский начальник Ионов прибыл с генералом [М.Д. Ско­белевым]. Представил меня генера­лу. Генерал встретил меня приветли­во, отнесся с уважением. Я осталась довольна...
В это мирное время я заявляю: весь мой народ, я сама и мои род­ные никогда не выступим против Вас. От нас никакой неприятности не будет. Если мой народ сделает плохо и станет изменником, тогда накажу виновного самой тяжкой мерой, буду вечно мучиться до кон­ца дней своих. В завершение ставлю свою пе­чать - дочь Маматбека Курманджан-датка. В связи с потерей печати -подписываюсь».alt
Личная жизнь Курманджан была полна драматических событий. Оставаясь богатой, владея много­численным поголовьем скота, она пользовалась бесприкословным авторитетом у кыргызов. Волост­ными управителями были устрое­ны ее сыновья. Но когда двое из сы­новей и два внука были обвинены в контрабанде товарами и убийстве таможенников, Курманджан при всем своем влиянии не смогла им помочь. Не имели успеха лич­ные обращения к ошскому уездно­му начальнику, ферганскому воен­ному губернатору и туркестанско­му генерал-губернатору. Любимый сын Камчибек был повешен на главной площади Оша при огром­ном стечении народа и в присут­ствии самого военного губернато­ра Повало-Швыйковского. Другой 1 февраля 1907 г. в селении Малы, что в 13 верстах от г. Ош умирала 96-летняя «алаиская царица».
У ее постели в благоговейном молчании стоя­ло множество людей всех возрастов - многочис­ленное потомство. Но даже такая большая юрта не смогла вместить всех внуков, правнуков и пра­правнуков датки.
Слух о ее болезни заставил многих приехать в ее аил.
Еще бы! Женщина, сама выбравшая себе мужа! Женщина, наследовавшая управление Алаем. Жен­щина-генерал! Получившая высокое звание из рук правоверного эмира Бухары, звание, подкреплен­ное кокандским Худояр-ханом! Ходил слух, что она также и поэтесса, известная под псевдонимом Зин-нат! Умирала алаиская царица - основательница огромного клана.
Весть о ее смерти мгновенно разнеслась по округе. Отовсюду ехали конные, шли пешие. Мах­муд-бек на правах хозяина встречал наиболее по­четных прибывающих. Перед входом в юрту в два ряда-внуки и правнуки покойной. И каждый раз по приезде нового гостя усиливался плач и скорб­ные причитания.
altПокойница лежала не на полу (как это было принято), а на столе под парчовым покрывалом. Рядом с нею - подарки государя-императора, а также подношения восьми генерал-губернато­ров, которых пережила датка, бесчисленные дары от уездных начальников и прочих чинов. Русская администрация с большим почтением относилась к Курманджан и во всех официаль­ных бумагах именовала ее не иначе, как «дат­ка» - правительница.
К моменту смерти Курманджан из 183 ее по­томков оставалось в живых 98 (два сына, две до­чери, 31 внук, 57 правнуков и 6 праправнуков). Сын - Маматбек и два внука - Арсланбек и Мирзапаяс - были зако­ваны в цепи и сосланы на каторгу в Сибирь. Такого оскорбления и позора Курманджан перенести не смогла. Датка была подавлена мо­рально: она раздала весь свой скот, уединилась в родном аиле, никого не принимала.
Имя Курманджан стало леген­дарным, память о ней дошла до на­ших дней. Память, подкрепленная героическими делами ее потом­ков: Кадырбек Камчибеков и Джам-шибек Карабеков - внуки «алай-ской царицы» - стали членами большевистской партии, кавалера­ми боевых орденов Советской ре­спублики, а праправнук - Муса Мирзапаясович Адышев - видный ученый-геолог, был президентом Академии наук Кыргызской Рес­публики.
</p>
            """,
            defaultTextStyle: paragraphTextStyle,
            useRichText: true,
            ),
          ],
        ),
      ),
      ),
    );
  }
}